Contents of the .debug_info section:

  Compilation Unit @ offset 0x0:
   Length:        0x815 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x0
   Pointer Size:  4
 <0><c>: Abbrev Number: 19 (DW_TAG_compile_unit)
    <d>   DW_AT_producer    : (indirect string, offset: 0xb3ef9): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <11>   DW_AT_language    : 29	(C11)
    <12>   DW_AT_name        : (indirect string, offset: 0x96dbc): ../Core/Src/HC_SR04.c
    <16>   DW_AT_comp_dir    : (indirect string, offset: 0x85467): C:/Users/quocv/STM32CubeIDE/workspace_1.14.0/DA2/Debug
    <1a>   DW_AT_ranges      : 0xc
    <1e>   DW_AT_low_pc      : 0x0
    <22>   DW_AT_stmt_list   : 0x0
    <26>   DW_AT_macros      : 0x0
 <1><2a>: Abbrev Number: 6 (DW_TAG_base_type)
    <2b>   DW_AT_byte_size   : 1
    <2c>   DW_AT_encoding    : 6	(signed char)
    <2d>   DW_AT_name        : (indirect string, offset: 0x618c5): signed char
 <1><31>: Abbrev Number: 5 (DW_TAG_typedef)
    <32>   DW_AT_name        : (indirect string, offset: 0x39211): __uint8_t
    <36>   DW_AT_decl_file   : 2
    <37>   DW_AT_decl_line   : 43
    <38>   DW_AT_decl_column : 24
    <39>   DW_AT_type        : <0x3d>
 <1><3d>: Abbrev Number: 6 (DW_TAG_base_type)
    <3e>   DW_AT_byte_size   : 1
    <3f>   DW_AT_encoding    : 8	(unsigned char)
    <40>   DW_AT_name        : (indirect string, offset: 0xbbce9): unsigned char
 <1><44>: Abbrev Number: 6 (DW_TAG_base_type)
    <45>   DW_AT_byte_size   : 2
    <46>   DW_AT_encoding    : 5	(signed)
    <47>   DW_AT_name        : (indirect string, offset: 0x90b96): short int
 <1><4b>: Abbrev Number: 5 (DW_TAG_typedef)
    <4c>   DW_AT_name        : (indirect string, offset: 0x9ea79): __uint16_t
    <50>   DW_AT_decl_file   : 2
    <51>   DW_AT_decl_line   : 57
    <52>   DW_AT_decl_column : 25
    <53>   DW_AT_type        : <0x57>
 <1><57>: Abbrev Number: 6 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 2
    <59>   DW_AT_encoding    : 7	(unsigned)
    <5a>   DW_AT_name        : (indirect string, offset: 0xba586): short unsigned int
 <1><5e>: Abbrev Number: 6 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 4
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (indirect string, offset: 0xffe4): long int
 <1><65>: Abbrev Number: 5 (DW_TAG_typedef)
    <66>   DW_AT_name        : (indirect string, offset: 0x7bfc8): __uint32_t
    <6a>   DW_AT_decl_file   : 2
    <6b>   DW_AT_decl_line   : 79
    <6c>   DW_AT_decl_column : 25
    <6d>   DW_AT_type        : <0x71>
 <1><71>: Abbrev Number: 6 (DW_TAG_base_type)
    <72>   DW_AT_byte_size   : 4
    <73>   DW_AT_encoding    : 7	(unsigned)
    <74>   DW_AT_name        : (indirect string, offset: 0x4aab6): long unsigned int
 <1><78>: Abbrev Number: 6 (DW_TAG_base_type)
    <79>   DW_AT_byte_size   : 8
    <7a>   DW_AT_encoding    : 5	(signed)
    <7b>   DW_AT_name        : (indirect string, offset: 0x59075): long long int
 <1><7f>: Abbrev Number: 6 (DW_TAG_base_type)
    <80>   DW_AT_byte_size   : 8
    <81>   DW_AT_encoding    : 7	(unsigned)
    <82>   DW_AT_name        : (indirect string, offset: 0x28f40): long long unsigned int
 <1><86>: Abbrev Number: 20 (DW_TAG_base_type)
    <87>   DW_AT_byte_size   : 4
    <88>   DW_AT_encoding    : 5	(signed)
    <89>   DW_AT_name        : int
 <1><8d>: Abbrev Number: 6 (DW_TAG_base_type)
    <8e>   DW_AT_byte_size   : 4
    <8f>   DW_AT_encoding    : 7	(unsigned)
    <90>   DW_AT_name        : (indirect string, offset: 0xf6b7): unsigned int
 <1><94>: Abbrev Number: 5 (DW_TAG_typedef)
    <95>   DW_AT_name        : (indirect string, offset: 0x39213): uint8_t
    <99>   DW_AT_decl_file   : 3
    <9a>   DW_AT_decl_line   : 24
    <9b>   DW_AT_decl_column : 19
    <9c>   DW_AT_type        : <0x31>
 <1><a0>: Abbrev Number: 5 (DW_TAG_typedef)
    <a1>   DW_AT_name        : (indirect string, offset: 0xd0b8e): uint16_t
    <a5>   DW_AT_decl_file   : 3
    <a6>   DW_AT_decl_line   : 36
    <a7>   DW_AT_decl_column : 20
    <a8>   DW_AT_type        : <0x4b>
 <1><ac>: Abbrev Number: 5 (DW_TAG_typedef)
    <ad>   DW_AT_name        : (indirect string, offset: 0xd0af8): uint32_t
    <b1>   DW_AT_decl_file   : 3
    <b2>   DW_AT_decl_line   : 48
    <b3>   DW_AT_decl_column : 20
    <b4>   DW_AT_type        : <0x65>
 <1><b8>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <b9>   DW_AT_type        : <0xac>
 <1><bd>: Abbrev Number: 12 (DW_TAG_structure_type)
    <be>   DW_AT_byte_size   : 24
    <bf>   DW_AT_decl_file   : 4
    <c0>   DW_AT_decl_line   : 345
    <c2>   DW_AT_decl_column : 9
    <c2>   DW_AT_sibling     : <0x114>
 <2><c6>: Abbrev Number: 4 (DW_TAG_member)
    <c7>   DW_AT_name        : CR
    <ca>   DW_AT_decl_file   : 4
    <ca>   DW_AT_decl_line   : 347
    <cc>   DW_AT_decl_column : 17
    <cc>   DW_AT_type        : <0xb8>
    <d0>   DW_AT_data_member_location: 0
 <2><d1>: Abbrev Number: 2 (DW_TAG_member)
    <d2>   DW_AT_name        : (indirect string, offset: 0x4a352): NDTR
    <d6>   DW_AT_decl_file   : 4
    <d7>   DW_AT_decl_line   : 348
    <d9>   DW_AT_decl_column : 17
    <da>   DW_AT_type        : <0xb8>
    <de>   DW_AT_data_member_location: 4
 <2><df>: Abbrev Number: 4 (DW_TAG_member)
    <e0>   DW_AT_name        : PAR
    <e4>   DW_AT_decl_file   : 4
    <e4>   DW_AT_decl_line   : 349
    <e6>   DW_AT_decl_column : 17
    <e6>   DW_AT_type        : <0xb8>
    <ea>   DW_AT_data_member_location: 8
 <2><eb>: Abbrev Number: 2 (DW_TAG_member)
    <ec>   DW_AT_name        : (indirect string, offset: 0x5110e): M0AR
    <f0>   DW_AT_decl_file   : 4
    <f1>   DW_AT_decl_line   : 350
    <f3>   DW_AT_decl_column : 17
    <f4>   DW_AT_type        : <0xb8>
    <f8>   DW_AT_data_member_location: 12
 <2><f9>: Abbrev Number: 2 (DW_TAG_member)
    <fa>   DW_AT_name        : (indirect string, offset: 0x6bdcf): M1AR
    <fe>   DW_AT_decl_file   : 4
    <ff>   DW_AT_decl_line   : 351
    <101>   DW_AT_decl_column : 17
    <102>   DW_AT_type        : <0xb8>
    <106>   DW_AT_data_member_location: 16
 <2><107>: Abbrev Number: 4 (DW_TAG_member)
    <108>   DW_AT_name        : FCR
    <10c>   DW_AT_decl_file   : 4
    <10c>   DW_AT_decl_line   : 352
    <10e>   DW_AT_decl_column : 17
    <10e>   DW_AT_type        : <0xb8>
    <112>   DW_AT_data_member_location: 20
 <2><113>: Abbrev Number: 0
 <1><114>: Abbrev Number: 7 (DW_TAG_typedef)
    <115>   DW_AT_name        : (indirect string, offset: 0xb0897): DMA_Stream_TypeDef
    <119>   DW_AT_decl_file   : 4
    <11a>   DW_AT_decl_line   : 353
    <11c>   DW_AT_decl_column : 3
    <11c>   DW_AT_type        : <0xbd>
 <1><120>: Abbrev Number: 12 (DW_TAG_structure_type)
    <121>   DW_AT_byte_size   : 40
    <122>   DW_AT_decl_file   : 4
    <123>   DW_AT_decl_line   : 526
    <125>   DW_AT_decl_column : 9
    <125>   DW_AT_sibling     : <0x1a2>
 <2><129>: Abbrev Number: 2 (DW_TAG_member)
    <12a>   DW_AT_name        : (indirect string, offset: 0x7e868): MODER
    <12e>   DW_AT_decl_file   : 4
    <12f>   DW_AT_decl_line   : 528
    <131>   DW_AT_decl_column : 17
    <132>   DW_AT_type        : <0xb8>
    <136>   DW_AT_data_member_location: 0
 <2><137>: Abbrev Number: 2 (DW_TAG_member)
    <138>   DW_AT_name        : (indirect string, offset: 0x96505): OTYPER
    <13c>   DW_AT_decl_file   : 4
    <13d>   DW_AT_decl_line   : 529
    <13f>   DW_AT_decl_column : 17
    <140>   DW_AT_type        : <0xb8>
    <144>   DW_AT_data_member_location: 4
 <2><145>: Abbrev Number: 2 (DW_TAG_member)
    <146>   DW_AT_name        : (indirect string, offset: 0xa910f): OSPEEDR
    <14a>   DW_AT_decl_file   : 4
    <14b>   DW_AT_decl_line   : 530
    <14d>   DW_AT_decl_column : 17
    <14e>   DW_AT_type        : <0xb8>
    <152>   DW_AT_data_member_location: 8
 <2><153>: Abbrev Number: 2 (DW_TAG_member)
    <154>   DW_AT_name        : (indirect string, offset: 0x70c0e): PUPDR
    <158>   DW_AT_decl_file   : 4
    <159>   DW_AT_decl_line   : 531
    <15b>   DW_AT_decl_column : 17
    <15c>   DW_AT_type        : <0xb8>
    <160>   DW_AT_data_member_location: 12
 <2><161>: Abbrev Number: 4 (DW_TAG_member)
    <162>   DW_AT_name        : IDR
    <166>   DW_AT_decl_file   : 4
    <166>   DW_AT_decl_line   : 532
    <168>   DW_AT_decl_column : 17
    <168>   DW_AT_type        : <0xb8>
    <16c>   DW_AT_data_member_location: 16
 <2><16d>: Abbrev Number: 4 (DW_TAG_member)
    <16e>   DW_AT_name        : ODR
    <172>   DW_AT_decl_file   : 4
    <172>   DW_AT_decl_line   : 533
    <174>   DW_AT_decl_column : 17
    <174>   DW_AT_type        : <0xb8>
    <178>   DW_AT_data_member_location: 20
 <2><179>: Abbrev Number: 2 (DW_TAG_member)
    <17a>   DW_AT_name        : (indirect string, offset: 0x2c4a3): BSRR
    <17e>   DW_AT_decl_file   : 4
    <17f>   DW_AT_decl_line   : 534
    <181>   DW_AT_decl_column : 17
    <182>   DW_AT_type        : <0xb8>
    <186>   DW_AT_data_member_location: 24
 <2><187>: Abbrev Number: 2 (DW_TAG_member)
    <188>   DW_AT_name        : (indirect string, offset: 0xa6937): LCKR
    <18c>   DW_AT_decl_file   : 4
    <18d>   DW_AT_decl_line   : 535
    <18f>   DW_AT_decl_column : 17
    <190>   DW_AT_type        : <0xb8>
    <194>   DW_AT_data_member_location: 28
 <2><195>: Abbrev Number: 4 (DW_TAG_member)
    <196>   DW_AT_name        : AFR
    <19a>   DW_AT_decl_file   : 4
    <19a>   DW_AT_decl_line   : 536
    <19c>   DW_AT_decl_column : 17
    <19c>   DW_AT_type        : <0x1b2>
    <1a0>   DW_AT_data_member_location: 32
 <2><1a1>: Abbrev Number: 0
 <1><1a2>: Abbrev Number: 14 (DW_TAG_array_type)
    <1a3>   DW_AT_type        : <0xb8>
    <1a7>   DW_AT_sibling     : <0x1b2>
 <2><1ab>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <1ac>   DW_AT_type        : <0x8d>
    <1b0>   DW_AT_upper_bound : 1
 <2><1b1>: Abbrev Number: 0
 <1><1b2>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <1b3>   DW_AT_type        : <0x1a2>
 <1><1b7>: Abbrev Number: 7 (DW_TAG_typedef)
    <1b8>   DW_AT_name        : (indirect string, offset: 0xbcddf): GPIO_TypeDef
    <1bc>   DW_AT_decl_file   : 4
    <1bd>   DW_AT_decl_line   : 537
    <1bf>   DW_AT_decl_column : 3
    <1bf>   DW_AT_type        : <0x120>
 <1><1c3>: Abbrev Number: 12 (DW_TAG_structure_type)
    <1c4>   DW_AT_byte_size   : 84
    <1c5>   DW_AT_decl_file   : 4
    <1c6>   DW_AT_decl_line   : 728
    <1c8>   DW_AT_decl_column : 9
    <1c8>   DW_AT_sibling     : <0x2dd>
 <2><1cc>: Abbrev Number: 4 (DW_TAG_member)
    <1cd>   DW_AT_name        : CR1
    <1d1>   DW_AT_decl_file   : 4
    <1d1>   DW_AT_decl_line   : 730
    <1d3>   DW_AT_decl_column : 17
    <1d3>   DW_AT_type        : <0xb8>
    <1d7>   DW_AT_data_member_location: 0
 <2><1d8>: Abbrev Number: 4 (DW_TAG_member)
    <1d9>   DW_AT_name        : CR2
    <1dd>   DW_AT_decl_file   : 4
    <1dd>   DW_AT_decl_line   : 731
    <1df>   DW_AT_decl_column : 17
    <1df>   DW_AT_type        : <0xb8>
    <1e3>   DW_AT_data_member_location: 4
 <2><1e4>: Abbrev Number: 2 (DW_TAG_member)
    <1e5>   DW_AT_name        : (indirect string, offset: 0x39a54): SMCR
    <1e9>   DW_AT_decl_file   : 4
    <1ea>   DW_AT_decl_line   : 732
    <1ec>   DW_AT_decl_column : 17
    <1ed>   DW_AT_type        : <0xb8>
    <1f1>   DW_AT_data_member_location: 8
 <2><1f2>: Abbrev Number: 2 (DW_TAG_member)
    <1f3>   DW_AT_name        : (indirect string, offset: 0x3f90c): DIER
    <1f7>   DW_AT_decl_file   : 4
    <1f8>   DW_AT_decl_line   : 733
    <1fa>   DW_AT_decl_column : 17
    <1fb>   DW_AT_type        : <0xb8>
    <1ff>   DW_AT_data_member_location: 12
 <2><200>: Abbrev Number: 4 (DW_TAG_member)
    <201>   DW_AT_name        : SR
    <204>   DW_AT_decl_file   : 4
    <204>   DW_AT_decl_line   : 734
    <206>   DW_AT_decl_column : 17
    <206>   DW_AT_type        : <0xb8>
    <20a>   DW_AT_data_member_location: 16
 <2><20b>: Abbrev Number: 4 (DW_TAG_member)
    <20c>   DW_AT_name        : EGR
    <210>   DW_AT_decl_file   : 4
    <210>   DW_AT_decl_line   : 735
    <212>   DW_AT_decl_column : 17
    <212>   DW_AT_type        : <0xb8>
    <216>   DW_AT_data_member_location: 20
 <2><217>: Abbrev Number: 2 (DW_TAG_member)
    <218>   DW_AT_name        : (indirect string, offset: 0xb162f): CCMR1
    <21c>   DW_AT_decl_file   : 4
    <21d>   DW_AT_decl_line   : 736
    <21f>   DW_AT_decl_column : 17
    <220>   DW_AT_type        : <0xb8>
    <224>   DW_AT_data_member_location: 24
 <2><225>: Abbrev Number: 2 (DW_TAG_member)
    <226>   DW_AT_name        : (indirect string, offset: 0x4decd): CCMR2
    <22a>   DW_AT_decl_file   : 4
    <22b>   DW_AT_decl_line   : 737
    <22d>   DW_AT_decl_column : 17
    <22e>   DW_AT_type        : <0xb8>
    <232>   DW_AT_data_member_location: 28
 <2><233>: Abbrev Number: 2 (DW_TAG_member)
    <234>   DW_AT_name        : (indirect string, offset: 0x2fc4d): CCER
    <238>   DW_AT_decl_file   : 4
    <239>   DW_AT_decl_line   : 738
    <23b>   DW_AT_decl_column : 17
    <23c>   DW_AT_type        : <0xb8>
    <240>   DW_AT_data_member_location: 32
 <2><241>: Abbrev Number: 4 (DW_TAG_member)
    <242>   DW_AT_name        : CNT
    <246>   DW_AT_decl_file   : 4
    <246>   DW_AT_decl_line   : 739
    <248>   DW_AT_decl_column : 17
    <248>   DW_AT_type        : <0xb8>
    <24c>   DW_AT_data_member_location: 36
 <2><24d>: Abbrev Number: 4 (DW_TAG_member)
    <24e>   DW_AT_name        : PSC
    <252>   DW_AT_decl_file   : 4
    <252>   DW_AT_decl_line   : 740
    <254>   DW_AT_decl_column : 17
    <254>   DW_AT_type        : <0xb8>
    <258>   DW_AT_data_member_location: 40
 <2><259>: Abbrev Number: 4 (DW_TAG_member)
    <25a>   DW_AT_name        : ARR
    <25e>   DW_AT_decl_file   : 4
    <25e>   DW_AT_decl_line   : 741
    <260>   DW_AT_decl_column : 17
    <260>   DW_AT_type        : <0xb8>
    <264>   DW_AT_data_member_location: 44
 <2><265>: Abbrev Number: 4 (DW_TAG_member)
    <266>   DW_AT_name        : RCR
    <26a>   DW_AT_decl_file   : 4
    <26a>   DW_AT_decl_line   : 742
    <26c>   DW_AT_decl_column : 17
    <26c>   DW_AT_type        : <0xb8>
    <270>   DW_AT_data_member_location: 48
 <2><271>: Abbrev Number: 2 (DW_TAG_member)
    <272>   DW_AT_name        : (indirect string, offset: 0x16d42): CCR1
    <276>   DW_AT_decl_file   : 4
    <277>   DW_AT_decl_line   : 743
    <279>   DW_AT_decl_column : 17
    <27a>   DW_AT_type        : <0xb8>
    <27e>   DW_AT_data_member_location: 52
 <2><27f>: Abbrev Number: 2 (DW_TAG_member)
    <280>   DW_AT_name        : (indirect string, offset: 0x51c63): CCR2
    <284>   DW_AT_decl_file   : 4
    <285>   DW_AT_decl_line   : 744
    <287>   DW_AT_decl_column : 17
    <288>   DW_AT_type        : <0xb8>
    <28c>   DW_AT_data_member_location: 56
 <2><28d>: Abbrev Number: 2 (DW_TAG_member)
    <28e>   DW_AT_name        : (indirect string, offset: 0x945e5): CCR3
    <292>   DW_AT_decl_file   : 4
    <293>   DW_AT_decl_line   : 745
    <295>   DW_AT_decl_column : 17
    <296>   DW_AT_type        : <0xb8>
    <29a>   DW_AT_data_member_location: 60
 <2><29b>: Abbrev Number: 2 (DW_TAG_member)
    <29c>   DW_AT_name        : (indirect string, offset: 0xbe48): CCR4
    <2a0>   DW_AT_decl_file   : 4
    <2a1>   DW_AT_decl_line   : 746
    <2a3>   DW_AT_decl_column : 17
    <2a4>   DW_AT_type        : <0xb8>
    <2a8>   DW_AT_data_member_location: 64
 <2><2a9>: Abbrev Number: 2 (DW_TAG_member)
    <2aa>   DW_AT_name        : (indirect string, offset: 0x8484c): BDTR
    <2ae>   DW_AT_decl_file   : 4
    <2af>   DW_AT_decl_line   : 747
    <2b1>   DW_AT_decl_column : 17
    <2b2>   DW_AT_type        : <0xb8>
    <2b6>   DW_AT_data_member_location: 68
 <2><2b7>: Abbrev Number: 4 (DW_TAG_member)
    <2b8>   DW_AT_name        : DCR
    <2bc>   DW_AT_decl_file   : 4
    <2bc>   DW_AT_decl_line   : 748
    <2be>   DW_AT_decl_column : 17
    <2be>   DW_AT_type        : <0xb8>
    <2c2>   DW_AT_data_member_location: 72
 <2><2c3>: Abbrev Number: 2 (DW_TAG_member)
    <2c4>   DW_AT_name        : (indirect string, offset: 0xa6f36): DMAR
    <2c8>   DW_AT_decl_file   : 4
    <2c9>   DW_AT_decl_line   : 749
    <2cb>   DW_AT_decl_column : 17
    <2cc>   DW_AT_type        : <0xb8>
    <2d0>   DW_AT_data_member_location: 76
 <2><2d1>: Abbrev Number: 4 (DW_TAG_member)
    <2d2>   DW_AT_name        : OR
    <2d5>   DW_AT_decl_file   : 4
    <2d5>   DW_AT_decl_line   : 750
    <2d7>   DW_AT_decl_column : 17
    <2d7>   DW_AT_type        : <0xb8>
    <2db>   DW_AT_data_member_location: 80
 <2><2dc>: Abbrev Number: 0
 <1><2dd>: Abbrev Number: 7 (DW_TAG_typedef)
    <2de>   DW_AT_name        : (indirect string, offset: 0xb81d8): TIM_TypeDef
    <2e2>   DW_AT_decl_file   : 4
    <2e3>   DW_AT_decl_line   : 751
    <2e5>   DW_AT_decl_column : 3
    <2e5>   DW_AT_type        : <0x1c3>
 <1><2e9>: Abbrev Number: 6 (DW_TAG_base_type)
    <2ea>   DW_AT_byte_size   : 8
    <2eb>   DW_AT_encoding    : 4	(float)
    <2ec>   DW_AT_name        : (indirect string, offset: 0xc5324): long double
 <1><2f0>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <2f1>   DW_AT_encoding    : 7	(unsigned)
    <2f1>   DW_AT_byte_size   : 1
    <2f1>   DW_AT_type        : <0x3d>
    <2f5>   DW_AT_decl_file   : 5
    <2f6>   DW_AT_decl_line   : 50
    <2f7>   DW_AT_decl_column : 1
    <2f7>   DW_AT_sibling     : <0x308>
 <2><2fb>: Abbrev Number: 3 (DW_TAG_enumerator)
    <2fc>   DW_AT_name        : (indirect string, offset: 0x8f95a): HAL_UNLOCKED
    <300>   DW_AT_const_value : 0
 <2><301>: Abbrev Number: 3 (DW_TAG_enumerator)
    <302>   DW_AT_name        : (indirect string, offset: 0xc265e): HAL_LOCKED
    <306>   DW_AT_const_value : 1
 <2><307>: Abbrev Number: 0
 <1><308>: Abbrev Number: 5 (DW_TAG_typedef)
    <309>   DW_AT_name        : (indirect string, offset: 0x733a7): HAL_LockTypeDef
    <30d>   DW_AT_decl_file   : 5
    <30e>   DW_AT_decl_line   : 53
    <30f>   DW_AT_decl_column : 3
    <310>   DW_AT_type        : <0x2f0>
 <1><314>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <315>   DW_AT_encoding    : 7	(unsigned)
    <315>   DW_AT_byte_size   : 1
    <315>   DW_AT_type        : <0x3d>
    <319>   DW_AT_decl_file   : 6
    <31a>   DW_AT_decl_line   : 68
    <31b>   DW_AT_decl_column : 1
    <31b>   DW_AT_sibling     : <0x32c>
 <2><31f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <320>   DW_AT_name        : (indirect string, offset: 0x28ac8): GPIO_PIN_RESET
    <324>   DW_AT_const_value : 0
 <2><325>: Abbrev Number: 3 (DW_TAG_enumerator)
    <326>   DW_AT_name        : (indirect string, offset: 0x229a3): GPIO_PIN_SET
    <32a>   DW_AT_const_value : 1
 <2><32b>: Abbrev Number: 0
 <1><32c>: Abbrev Number: 5 (DW_TAG_typedef)
    <32d>   DW_AT_name        : (indirect string, offset: 0xbf149): GPIO_PinState
    <331>   DW_AT_decl_file   : 6
    <332>   DW_AT_decl_line   : 71
    <333>   DW_AT_decl_column : 2
    <334>   DW_AT_type        : <0x314>
 <1><338>: Abbrev Number: 17 (DW_TAG_structure_type)
    <339>   DW_AT_byte_size   : 48
    <33a>   DW_AT_decl_file   : 7
    <33b>   DW_AT_decl_line   : 48
    <33c>   DW_AT_decl_column : 9
    <33c>   DW_AT_sibling     : <0x3dd>
 <2><340>: Abbrev Number: 1 (DW_TAG_member)
    <341>   DW_AT_name        : (indirect string, offset: 0x65576): Channel
    <345>   DW_AT_decl_file   : 7
    <346>   DW_AT_decl_line   : 50
    <347>   DW_AT_decl_column : 12
    <348>   DW_AT_type        : <0xac>
    <34c>   DW_AT_data_member_location: 0
 <2><34d>: Abbrev Number: 1 (DW_TAG_member)
    <34e>   DW_AT_name        : (indirect string, offset: 0xd7514): Direction
    <352>   DW_AT_decl_file   : 7
    <353>   DW_AT_decl_line   : 53
    <354>   DW_AT_decl_column : 12
    <355>   DW_AT_type        : <0xac>
    <359>   DW_AT_data_member_location: 4
 <2><35a>: Abbrev Number: 1 (DW_TAG_member)
    <35b>   DW_AT_name        : (indirect string, offset: 0xc91f): PeriphInc
    <35f>   DW_AT_decl_file   : 7
    <360>   DW_AT_decl_line   : 57
    <361>   DW_AT_decl_column : 12
    <362>   DW_AT_type        : <0xac>
    <366>   DW_AT_data_member_location: 8
 <2><367>: Abbrev Number: 1 (DW_TAG_member)
    <368>   DW_AT_name        : (indirect string, offset: 0x1e829): MemInc
    <36c>   DW_AT_decl_file   : 7
    <36d>   DW_AT_decl_line   : 60
    <36e>   DW_AT_decl_column : 12
    <36f>   DW_AT_type        : <0xac>
    <373>   DW_AT_data_member_location: 12
 <2><374>: Abbrev Number: 1 (DW_TAG_member)
    <375>   DW_AT_name        : (indirect string, offset: 0x60ba9): PeriphDataAlignment
    <379>   DW_AT_decl_file   : 7
    <37a>   DW_AT_decl_line   : 63
    <37b>   DW_AT_decl_column : 12
    <37c>   DW_AT_type        : <0xac>
    <380>   DW_AT_data_member_location: 16
 <2><381>: Abbrev Number: 1 (DW_TAG_member)
    <382>   DW_AT_name        : (indirect string, offset: 0xafdd8): MemDataAlignment
    <386>   DW_AT_decl_file   : 7
    <387>   DW_AT_decl_line   : 66
    <388>   DW_AT_decl_column : 12
    <389>   DW_AT_type        : <0xac>
    <38d>   DW_AT_data_member_location: 20
 <2><38e>: Abbrev Number: 1 (DW_TAG_member)
    <38f>   DW_AT_name        : (indirect string, offset: 0xd6f9e): Mode
    <393>   DW_AT_decl_file   : 7
    <394>   DW_AT_decl_line   : 69
    <395>   DW_AT_decl_column : 12
    <396>   DW_AT_type        : <0xac>
    <39a>   DW_AT_data_member_location: 24
 <2><39b>: Abbrev Number: 1 (DW_TAG_member)
    <39c>   DW_AT_name        : (indirect string, offset: 0xda92d): Priority
    <3a0>   DW_AT_decl_file   : 7
    <3a1>   DW_AT_decl_line   : 74
    <3a2>   DW_AT_decl_column : 12
    <3a3>   DW_AT_type        : <0xac>
    <3a7>   DW_AT_data_member_location: 28
 <2><3a8>: Abbrev Number: 1 (DW_TAG_member)
    <3a9>   DW_AT_name        : (indirect string, offset: 0x540f6): FIFOMode
    <3ad>   DW_AT_decl_file   : 7
    <3ae>   DW_AT_decl_line   : 77
    <3af>   DW_AT_decl_column : 12
    <3b0>   DW_AT_type        : <0xac>
    <3b4>   DW_AT_data_member_location: 32
 <2><3b5>: Abbrev Number: 1 (DW_TAG_member)
    <3b6>   DW_AT_name        : (indirect string, offset: 0x93ad0): FIFOThreshold
    <3ba>   DW_AT_decl_file   : 7
    <3bb>   DW_AT_decl_line   : 82
    <3bc>   DW_AT_decl_column : 12
    <3bd>   DW_AT_type        : <0xac>
    <3c1>   DW_AT_data_member_location: 36
 <2><3c2>: Abbrev Number: 1 (DW_TAG_member)
    <3c3>   DW_AT_name        : (indirect string, offset: 0x91e8f): MemBurst
    <3c7>   DW_AT_decl_file   : 7
    <3c8>   DW_AT_decl_line   : 85
    <3c9>   DW_AT_decl_column : 12
    <3ca>   DW_AT_type        : <0xac>
    <3ce>   DW_AT_data_member_location: 40
 <2><3cf>: Abbrev Number: 1 (DW_TAG_member)
    <3d0>   DW_AT_name        : (indirect string, offset: 0x43074): PeriphBurst
    <3d4>   DW_AT_decl_file   : 7
    <3d5>   DW_AT_decl_line   : 91
    <3d6>   DW_AT_decl_column : 12
    <3d7>   DW_AT_type        : <0xac>
    <3db>   DW_AT_data_member_location: 44
 <2><3dc>: Abbrev Number: 0
 <1><3dd>: Abbrev Number: 5 (DW_TAG_typedef)
    <3de>   DW_AT_name        : (indirect string, offset: 0x34bad): DMA_InitTypeDef
    <3e2>   DW_AT_decl_file   : 7
    <3e3>   DW_AT_decl_line   : 96
    <3e4>   DW_AT_decl_column : 2
    <3e5>   DW_AT_type        : <0x338>
 <1><3e9>: Abbrev Number: 16 (DW_TAG_enumeration_type)
    <3ea>   DW_AT_encoding    : 7	(unsigned)
    <3ea>   DW_AT_byte_size   : 1
    <3ea>   DW_AT_type        : <0x3d>
    <3ee>   DW_AT_decl_file   : 7
    <3ef>   DW_AT_decl_line   : 103
    <3f0>   DW_AT_decl_column : 1
    <3f0>   DW_AT_sibling     : <0x419>
 <2><3f4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3f5>   DW_AT_name        : (indirect string, offset: 0xc469): HAL_DMA_STATE_RESET
    <3f9>   DW_AT_const_value : 0
 <2><3fa>: Abbrev Number: 3 (DW_TAG_enumerator)
    <3fb>   DW_AT_name        : (indirect string, offset: 0x35f38): HAL_DMA_STATE_READY
    <3ff>   DW_AT_const_value : 1
 <2><400>: Abbrev Number: 3 (DW_TAG_enumerator)
    <401>   DW_AT_name        : (indirect string, offset: 0x864ad): HAL_DMA_STATE_BUSY
    <405>   DW_AT_const_value : 2
 <2><406>: Abbrev Number: 3 (DW_TAG_enumerator)
    <407>   DW_AT_name        : (indirect string, offset: 0xbf4b7): HAL_DMA_STATE_TIMEOUT
    <40b>   DW_AT_const_value : 3
 <2><40c>: Abbrev Number: 3 (DW_TAG_enumerator)
    <40d>   DW_AT_name        : (indirect string, offset: 0x93569): HAL_DMA_STATE_ERROR
    <411>   DW_AT_const_value : 4
 <2><412>: Abbrev Number: 3 (DW_TAG_enumerator)
    <413>   DW_AT_name        : (indirect string, offset: 0x4c62e): HAL_DMA_STATE_ABORT
    <417>   DW_AT_const_value : 5
 <2><418>: Abbrev Number: 0
 <1><419>: Abbrev Number: 5 (DW_TAG_typedef)
    <41a>   DW_AT_name        : (indirect string, offset: 0xaf127): HAL_DMA_StateTypeDef
    <41e>   DW_AT_decl_file   : 7
    <41f>   DW_AT_decl_line   : 110
    <420>   DW_AT_decl_column : 2
    <421>   DW_AT_type        : <0x3e9>
 <1><425>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <426>   DW_AT_type        : <0x419>
 <1><42a>: Abbrev Number: 21 (DW_TAG_structure_type)
    <42b>   DW_AT_name        : (indirect string, offset: 0xa551e): __DMA_HandleTypeDef
    <42f>   DW_AT_byte_size   : 96
    <430>   DW_AT_decl_file   : 7
    <431>   DW_AT_decl_line   : 138
    <432>   DW_AT_decl_column : 16
    <433>   DW_AT_sibling     : <0x4ee>
 <2><437>: Abbrev Number: 1 (DW_TAG_member)
    <438>   DW_AT_name        : (indirect string, offset: 0xbc103): Instance
    <43c>   DW_AT_decl_file   : 7
    <43d>   DW_AT_decl_line   : 140
    <43e>   DW_AT_decl_column : 31
    <43f>   DW_AT_type        : <0x4ee>
    <443>   DW_AT_data_member_location: 0
 <2><444>: Abbrev Number: 1 (DW_TAG_member)
    <445>   DW_AT_name        : (indirect string, offset: 0xd699f): Init
    <449>   DW_AT_decl_file   : 7
    <44a>   DW_AT_decl_line   : 142
    <44b>   DW_AT_decl_column : 30
    <44c>   DW_AT_type        : <0x3dd>
    <450>   DW_AT_data_member_location: 4
 <2><451>: Abbrev Number: 1 (DW_TAG_member)
    <452>   DW_AT_name        : (indirect string, offset: 0x8a5bb): Lock
    <456>   DW_AT_decl_file   : 7
    <457>   DW_AT_decl_line   : 144
    <458>   DW_AT_decl_column : 30
    <459>   DW_AT_type        : <0x308>
    <45d>   DW_AT_data_member_location: 52
 <2><45e>: Abbrev Number: 1 (DW_TAG_member)
    <45f>   DW_AT_name        : (indirect string, offset: 0xd764e): State
    <463>   DW_AT_decl_file   : 7
    <464>   DW_AT_decl_line   : 146
    <465>   DW_AT_decl_column : 30
    <466>   DW_AT_type        : <0x425>
    <46a>   DW_AT_data_member_location: 53
 <2><46b>: Abbrev Number: 1 (DW_TAG_member)
    <46c>   DW_AT_name        : (indirect string, offset: 0xb9018): Parent
    <470>   DW_AT_decl_file   : 7
    <471>   DW_AT_decl_line   : 148
    <472>   DW_AT_decl_column : 31
    <473>   DW_AT_type        : <0x4f3>
    <477>   DW_AT_data_member_location: 56
 <2><478>: Abbrev Number: 1 (DW_TAG_member)
    <479>   DW_AT_name        : (indirect string, offset: 0xc19c0): XferCpltCallback
    <47d>   DW_AT_decl_file   : 7
    <47e>   DW_AT_decl_line   : 150
    <47f>   DW_AT_decl_column : 33
    <480>   DW_AT_type        : <0x505>
    <484>   DW_AT_data_member_location: 60
 <2><485>: Abbrev Number: 1 (DW_TAG_member)
    <486>   DW_AT_name        : (indirect string, offset: 0x970b8): XferHalfCpltCallback
    <48a>   DW_AT_decl_file   : 7
    <48b>   DW_AT_decl_line   : 152
    <48c>   DW_AT_decl_column : 33
    <48d>   DW_AT_type        : <0x505>
    <491>   DW_AT_data_member_location: 64
 <2><492>: Abbrev Number: 1 (DW_TAG_member)
    <493>   DW_AT_name        : (indirect string, offset: 0x72920): XferM1CpltCallback
    <497>   DW_AT_decl_file   : 7
    <498>   DW_AT_decl_line   : 154
    <499>   DW_AT_decl_column : 33
    <49a>   DW_AT_type        : <0x505>
    <49e>   DW_AT_data_member_location: 68
 <2><49f>: Abbrev Number: 1 (DW_TAG_member)
    <4a0>   DW_AT_name        : (indirect string, offset: 0x5dc19): XferM1HalfCpltCallback
    <4a4>   DW_AT_decl_file   : 7
    <4a5>   DW_AT_decl_line   : 156
    <4a6>   DW_AT_decl_column : 33
    <4a7>   DW_AT_type        : <0x505>
    <4ab>   DW_AT_data_member_location: 72
 <2><4ac>: Abbrev Number: 1 (DW_TAG_member)
    <4ad>   DW_AT_name        : (indirect string, offset: 0x1c167): XferErrorCallback
    <4b1>   DW_AT_decl_file   : 7
    <4b2>   DW_AT_decl_line   : 158
    <4b3>   DW_AT_decl_column : 33
    <4b4>   DW_AT_type        : <0x505>
    <4b8>   DW_AT_data_member_location: 76
 <2><4b9>: Abbrev Number: 1 (DW_TAG_member)
    <4ba>   DW_AT_name        : (indirect string, offset: 0xb58ee): XferAbortCallback
    <4be>   DW_AT_decl_file   : 7
    <4bf>   DW_AT_decl_line   : 160
    <4c0>   DW_AT_decl_column : 33
    <4c1>   DW_AT_type        : <0x505>
    <4c5>   DW_AT_data_member_location: 80
 <2><4c6>: Abbrev Number: 1 (DW_TAG_member)
    <4c7>   DW_AT_name        : (indirect string, offset: 0xbe1f4): ErrorCode
    <4cb>   DW_AT_decl_file   : 7
    <4cc>   DW_AT_decl_line   : 162
    <4cd>   DW_AT_decl_column : 30
    <4ce>   DW_AT_type        : <0xb8>
    <4d2>   DW_AT_data_member_location: 84
 <2><4d3>: Abbrev Number: 1 (DW_TAG_member)
    <4d4>   DW_AT_name        : (indirect string, offset: 0x57394): StreamBaseAddress
    <4d8>   DW_AT_decl_file   : 7
    <4d9>   DW_AT_decl_line   : 164
    <4da>   DW_AT_decl_column : 30
    <4db>   DW_AT_type        : <0xac>
    <4df>   DW_AT_data_member_location: 88
 <2><4e0>: Abbrev Number: 1 (DW_TAG_member)
    <4e1>   DW_AT_name        : (indirect string, offset: 0xa370f): StreamIndex
    <4e5>   DW_AT_decl_file   : 7
    <4e6>   DW_AT_decl_line   : 166
    <4e7>   DW_AT_decl_column : 30
    <4e8>   DW_AT_type        : <0xac>
    <4ec>   DW_AT_data_member_location: 92
 <2><4ed>: Abbrev Number: 0
 <1><4ee>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <4ef>   DW_AT_byte_size   : 4
    <4ef>   DW_AT_type        : <0x114>
 <1><4f3>: Abbrev Number: 22 (DW_TAG_pointer_type)
    <4f4>   DW_AT_byte_size   : 4
 <1><4f5>: Abbrev Number: 23 (DW_TAG_subroutine_type)
    <4f6>   DW_AT_prototyped  : 1
    <4f6>   DW_AT_sibling     : <0x500>
 <2><4fa>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <4fb>   DW_AT_type        : <0x500>
 <2><4ff>: Abbrev Number: 0
 <1><500>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <501>   DW_AT_byte_size   : 4
    <501>   DW_AT_type        : <0x42a>
 <1><505>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <506>   DW_AT_byte_size   : 4
    <506>   DW_AT_type        : <0x4f5>
 <1><50a>: Abbrev Number: 5 (DW_TAG_typedef)
    <50b>   DW_AT_name        : (indirect string, offset: 0xa5520): DMA_HandleTypeDef
    <50f>   DW_AT_decl_file   : 7
    <510>   DW_AT_decl_line   : 168
    <511>   DW_AT_decl_column : 2
    <512>   DW_AT_type        : <0x42a>
 <1><516>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <517>   DW_AT_byte_size   : 4
    <517>   DW_AT_type        : <0x50a>
 <1><51b>: Abbrev Number: 17 (DW_TAG_structure_type)
    <51c>   DW_AT_byte_size   : 24
    <51d>   DW_AT_decl_file   : 8
    <51e>   DW_AT_decl_line   : 46
    <51f>   DW_AT_decl_column : 9
    <51f>   DW_AT_sibling     : <0x572>
 <2><523>: Abbrev Number: 1 (DW_TAG_member)
    <524>   DW_AT_name        : (indirect string, offset: 0xdcbd2): Prescaler
    <528>   DW_AT_decl_file   : 8
    <529>   DW_AT_decl_line   : 48
    <52a>   DW_AT_decl_column : 12
    <52b>   DW_AT_type        : <0xac>
    <52f>   DW_AT_data_member_location: 0
 <2><530>: Abbrev Number: 1 (DW_TAG_member)
    <531>   DW_AT_name        : (indirect string, offset: 0xb0a32): CounterMode
    <535>   DW_AT_decl_file   : 8
    <536>   DW_AT_decl_line   : 51
    <537>   DW_AT_decl_column : 12
    <538>   DW_AT_type        : <0xac>
    <53c>   DW_AT_data_member_location: 4
 <2><53d>: Abbrev Number: 1 (DW_TAG_member)
    <53e>   DW_AT_name        : (indirect string, offset: 0xe24c5): Period
    <542>   DW_AT_decl_file   : 8
    <543>   DW_AT_decl_line   : 54
    <544>   DW_AT_decl_column : 12
    <545>   DW_AT_type        : <0xac>
    <549>   DW_AT_data_member_location: 8
 <2><54a>: Abbrev Number: 1 (DW_TAG_member)
    <54b>   DW_AT_name        : (indirect string, offset: 0x4f594): ClockDivision
    <54f>   DW_AT_decl_file   : 8
    <550>   DW_AT_decl_line   : 58
    <551>   DW_AT_decl_column : 12
    <552>   DW_AT_type        : <0xac>
    <556>   DW_AT_data_member_location: 12
 <2><557>: Abbrev Number: 1 (DW_TAG_member)
    <558>   DW_AT_name        : (indirect string, offset: 0x87bf6): RepetitionCounter
    <55c>   DW_AT_decl_file   : 8
    <55d>   DW_AT_decl_line   : 61
    <55e>   DW_AT_decl_column : 12
    <55f>   DW_AT_type        : <0xac>
    <563>   DW_AT_data_member_location: 16
 <2><564>: Abbrev Number: 1 (DW_TAG_member)
    <565>   DW_AT_name        : (indirect string, offset: 0xb35c7): AutoReloadPreload
    <569>   DW_AT_decl_file   : 8
    <56a>   DW_AT_decl_line   : 72
    <56b>   DW_AT_decl_column : 12
    <56c>   DW_AT_type        : <0xac>
    <570>   DW_AT_data_member_location: 20
 <2><571>: Abbrev Number: 0
 <1><572>: Abbrev Number: 5 (DW_TAG_typedef)
    <573>   DW_AT_name        : (indirect string, offset: 0x43973): TIM_Base_InitTypeDef
    <577>   DW_AT_decl_file   : 8
    <578>   DW_AT_decl_line   : 74
    <579>   DW_AT_decl_column : 3
    <57a>   DW_AT_type        : <0x51b>
 <1><57e>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <57f>   DW_AT_encoding    : 7	(unsigned)
    <57f>   DW_AT_byte_size   : 1
    <57f>   DW_AT_type        : <0x3d>
    <583>   DW_AT_decl_file   : 8
    <583>   DW_AT_decl_line   : 291
    <585>   DW_AT_decl_column : 1
    <585>   DW_AT_sibling     : <0x5a8>
 <2><589>: Abbrev Number: 3 (DW_TAG_enumerator)
    <58a>   DW_AT_name        : (indirect string, offset: 0x7a2e0): HAL_TIM_STATE_RESET
    <58e>   DW_AT_const_value : 0
 <2><58f>: Abbrev Number: 3 (DW_TAG_enumerator)
    <590>   DW_AT_name        : (indirect string, offset: 0x6a83): HAL_TIM_STATE_READY
    <594>   DW_AT_const_value : 1
 <2><595>: Abbrev Number: 3 (DW_TAG_enumerator)
    <596>   DW_AT_name        : (indirect string, offset: 0x31791): HAL_TIM_STATE_BUSY
    <59a>   DW_AT_const_value : 2
 <2><59b>: Abbrev Number: 3 (DW_TAG_enumerator)
    <59c>   DW_AT_name        : (indirect string, offset: 0xa2852): HAL_TIM_STATE_TIMEOUT
    <5a0>   DW_AT_const_value : 3
 <2><5a1>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5a2>   DW_AT_name        : (indirect string, offset: 0x78544): HAL_TIM_STATE_ERROR
    <5a6>   DW_AT_const_value : 4
 <2><5a7>: Abbrev Number: 0
 <1><5a8>: Abbrev Number: 7 (DW_TAG_typedef)
    <5a9>   DW_AT_name        : (indirect string, offset: 0x7fb19): HAL_TIM_StateTypeDef
    <5ad>   DW_AT_decl_file   : 8
    <5ae>   DW_AT_decl_line   : 297
    <5b0>   DW_AT_decl_column : 3
    <5b0>   DW_AT_type        : <0x57e>
 <1><5b4>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <5b5>   DW_AT_type        : <0x5a8>
 <1><5b9>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <5ba>   DW_AT_encoding    : 7	(unsigned)
    <5ba>   DW_AT_byte_size   : 1
    <5ba>   DW_AT_type        : <0x3d>
    <5be>   DW_AT_decl_file   : 8
    <5be>   DW_AT_decl_line   : 303
    <5c0>   DW_AT_decl_column : 1
    <5c0>   DW_AT_sibling     : <0x5d7>
 <2><5c4>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5c5>   DW_AT_name        : (indirect string, offset: 0x88f3a): HAL_TIM_CHANNEL_STATE_RESET
    <5c9>   DW_AT_const_value : 0
 <2><5ca>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5cb>   DW_AT_name        : (indirect string, offset: 0x72c09): HAL_TIM_CHANNEL_STATE_READY
    <5cf>   DW_AT_const_value : 1
 <2><5d0>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5d1>   DW_AT_name        : (indirect string, offset: 0x5ddc6): HAL_TIM_CHANNEL_STATE_BUSY
    <5d5>   DW_AT_const_value : 2
 <2><5d6>: Abbrev Number: 0
 <1><5d7>: Abbrev Number: 7 (DW_TAG_typedef)
    <5d8>   DW_AT_name        : (indirect string, offset: 0x29466): HAL_TIM_ChannelStateTypeDef
    <5dc>   DW_AT_decl_file   : 8
    <5dd>   DW_AT_decl_line   : 307
    <5df>   DW_AT_decl_column : 3
    <5df>   DW_AT_type        : <0x5b9>
 <1><5e3>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <5e4>   DW_AT_type        : <0x5d7>
 <1><5e8>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <5e9>   DW_AT_encoding    : 7	(unsigned)
    <5e9>   DW_AT_byte_size   : 1
    <5e9>   DW_AT_type        : <0x3d>
    <5ed>   DW_AT_decl_file   : 8
    <5ed>   DW_AT_decl_line   : 313
    <5ef>   DW_AT_decl_column : 1
    <5ef>   DW_AT_sibling     : <0x606>
 <2><5f3>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5f4>   DW_AT_name        : (indirect string, offset: 0x3ce0): HAL_DMA_BURST_STATE_RESET
    <5f8>   DW_AT_const_value : 0
 <2><5f9>: Abbrev Number: 3 (DW_TAG_enumerator)
    <5fa>   DW_AT_name        : (indirect string, offset: 0x6b883): HAL_DMA_BURST_STATE_READY
    <5fe>   DW_AT_const_value : 1
 <2><5ff>: Abbrev Number: 3 (DW_TAG_enumerator)
    <600>   DW_AT_name        : (indirect string, offset: 0x421c1): HAL_DMA_BURST_STATE_BUSY
    <604>   DW_AT_const_value : 2
 <2><605>: Abbrev Number: 0
 <1><606>: Abbrev Number: 7 (DW_TAG_typedef)
    <607>   DW_AT_name        : (indirect string, offset: 0x1a749): HAL_TIM_DMABurstStateTypeDef
    <60b>   DW_AT_decl_file   : 8
    <60c>   DW_AT_decl_line   : 317
    <60e>   DW_AT_decl_column : 3
    <60e>   DW_AT_type        : <0x5e8>
 <1><612>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <613>   DW_AT_type        : <0x606>
 <1><617>: Abbrev Number: 13 (DW_TAG_enumeration_type)
    <618>   DW_AT_encoding    : 7	(unsigned)
    <618>   DW_AT_byte_size   : 1
    <618>   DW_AT_type        : <0x3d>
    <61c>   DW_AT_decl_file   : 8
    <61c>   DW_AT_decl_line   : 323
    <61e>   DW_AT_decl_column : 1
    <61e>   DW_AT_sibling     : <0x641>
 <2><622>: Abbrev Number: 3 (DW_TAG_enumerator)
    <623>   DW_AT_name        : (indirect string, offset: 0x6d8d0): HAL_TIM_ACTIVE_CHANNEL_1
    <627>   DW_AT_const_value : 1
 <2><628>: Abbrev Number: 3 (DW_TAG_enumerator)
    <629>   DW_AT_name        : (indirect string, offset: 0x6d8e9): HAL_TIM_ACTIVE_CHANNEL_2
    <62d>   DW_AT_const_value : 2
 <2><62e>: Abbrev Number: 3 (DW_TAG_enumerator)
    <62f>   DW_AT_name        : (indirect string, offset: 0x6d902): HAL_TIM_ACTIVE_CHANNEL_3
    <633>   DW_AT_const_value : 4
 <2><634>: Abbrev Number: 3 (DW_TAG_enumerator)
    <635>   DW_AT_name        : (indirect string, offset: 0x6d91b): HAL_TIM_ACTIVE_CHANNEL_4
    <639>   DW_AT_const_value : 8
 <2><63a>: Abbrev Number: 3 (DW_TAG_enumerator)
    <63b>   DW_AT_name        : (indirect string, offset: 0x5074f): HAL_TIM_ACTIVE_CHANNEL_CLEARED
    <63f>   DW_AT_const_value : 0
 <2><640>: Abbrev Number: 0
 <1><641>: Abbrev Number: 7 (DW_TAG_typedef)
    <642>   DW_AT_name        : (indirect string, offset: 0x65568): HAL_TIM_ActiveChannel
    <646>   DW_AT_decl_file   : 8
    <647>   DW_AT_decl_line   : 329
    <649>   DW_AT_decl_column : 3
    <649>   DW_AT_type        : <0x617>
 <1><64d>: Abbrev Number: 12 (DW_TAG_structure_type)
    <64e>   DW_AT_byte_size   : 72
    <64f>   DW_AT_decl_file   : 8
    <650>   DW_AT_decl_line   : 337
    <652>   DW_AT_decl_column : 9
    <652>   DW_AT_sibling     : <0x6d5>
 <2><656>: Abbrev Number: 2 (DW_TAG_member)
    <657>   DW_AT_name        : (indirect string, offset: 0xbc103): Instance
    <65b>   DW_AT_decl_file   : 8
    <65c>   DW_AT_decl_line   : 340
    <65e>   DW_AT_decl_column : 39
    <65f>   DW_AT_type        : <0x6d5>
    <663>   DW_AT_data_member_location: 0
 <2><664>: Abbrev Number: 2 (DW_TAG_member)
    <665>   DW_AT_name        : (indirect string, offset: 0xd699f): Init
    <669>   DW_AT_decl_file   : 8
    <66a>   DW_AT_decl_line   : 341
    <66c>   DW_AT_decl_column : 38
    <66d>   DW_AT_type        : <0x572>
    <671>   DW_AT_data_member_location: 4
 <2><672>: Abbrev Number: 2 (DW_TAG_member)
    <673>   DW_AT_name        : (indirect string, offset: 0x65576): Channel
    <677>   DW_AT_decl_file   : 8
    <678>   DW_AT_decl_line   : 342
    <67a>   DW_AT_decl_column : 38
    <67b>   DW_AT_type        : <0x641>
    <67f>   DW_AT_data_member_location: 28
 <2><680>: Abbrev Number: 2 (DW_TAG_member)
    <681>   DW_AT_name        : (indirect string, offset: 0x750bc): hdma
    <685>   DW_AT_decl_file   : 8
    <686>   DW_AT_decl_line   : 343
    <688>   DW_AT_decl_column : 39
    <689>   DW_AT_type        : <0x6da>
    <68d>   DW_AT_data_member_location: 32
 <2><68e>: Abbrev Number: 2 (DW_TAG_member)
    <68f>   DW_AT_name        : (indirect string, offset: 0x8a5bb): Lock
    <693>   DW_AT_decl_file   : 8
    <694>   DW_AT_decl_line   : 345
    <696>   DW_AT_decl_column : 38
    <697>   DW_AT_type        : <0x308>
    <69b>   DW_AT_data_member_location: 60
 <2><69c>: Abbrev Number: 2 (DW_TAG_member)
    <69d>   DW_AT_name        : (indirect string, offset: 0xd764e): State
    <6a1>   DW_AT_decl_file   : 8
    <6a2>   DW_AT_decl_line   : 346
    <6a4>   DW_AT_decl_column : 38
    <6a5>   DW_AT_type        : <0x5b4>
    <6a9>   DW_AT_data_member_location: 61
 <2><6aa>: Abbrev Number: 2 (DW_TAG_member)
    <6ab>   DW_AT_name        : (indirect string, offset: 0xdbd95): ChannelState
    <6af>   DW_AT_decl_file   : 8
    <6b0>   DW_AT_decl_line   : 347
    <6b2>   DW_AT_decl_column : 38
    <6b3>   DW_AT_type        : <0x6fa>
    <6b7>   DW_AT_data_member_location: 62
 <2><6b8>: Abbrev Number: 2 (DW_TAG_member)
    <6b9>   DW_AT_name        : (indirect string, offset: 0xdc30e): ChannelNState
    <6bd>   DW_AT_decl_file   : 8
    <6be>   DW_AT_decl_line   : 348
    <6c0>   DW_AT_decl_column : 38
    <6c1>   DW_AT_type        : <0x6fa>
    <6c5>   DW_AT_data_member_location: 66
 <2><6c6>: Abbrev Number: 2 (DW_TAG_member)
    <6c7>   DW_AT_name        : (indirect string, offset: 0xdb9eb): DMABurstState
    <6cb>   DW_AT_decl_file   : 8
    <6cc>   DW_AT_decl_line   : 349
    <6ce>   DW_AT_decl_column : 38
    <6cf>   DW_AT_type        : <0x612>
    <6d3>   DW_AT_data_member_location: 70
 <2><6d4>: Abbrev Number: 0
 <1><6d5>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <6d6>   DW_AT_byte_size   : 4
    <6d6>   DW_AT_type        : <0x2dd>
 <1><6da>: Abbrev Number: 14 (DW_TAG_array_type)
    <6db>   DW_AT_type        : <0x516>
    <6df>   DW_AT_sibling     : <0x6ea>
 <2><6e3>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <6e4>   DW_AT_type        : <0x8d>
    <6e8>   DW_AT_upper_bound : 6
 <2><6e9>: Abbrev Number: 0
 <1><6ea>: Abbrev Number: 14 (DW_TAG_array_type)
    <6eb>   DW_AT_type        : <0x5e3>
    <6ef>   DW_AT_sibling     : <0x6fa>
 <2><6f3>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <6f4>   DW_AT_type        : <0x8d>
    <6f8>   DW_AT_upper_bound : 3
 <2><6f9>: Abbrev Number: 0
 <1><6fa>: Abbrev Number: 9 (DW_TAG_volatile_type)
    <6fb>   DW_AT_type        : <0x6ea>
 <1><6ff>: Abbrev Number: 7 (DW_TAG_typedef)
    <700>   DW_AT_name        : (indirect string, offset: 0x433e4): TIM_HandleTypeDef
    <704>   DW_AT_decl_file   : 8
    <705>   DW_AT_decl_line   : 380
    <707>   DW_AT_decl_column : 3
    <707>   DW_AT_type        : <0x64d>
 <1><70b>: Abbrev Number: 24 (DW_TAG_const_type)
    <70c>   DW_AT_type        : <0x6ff>
 <1><710>: Abbrev Number: 25 (DW_TAG_variable)
    <711>   DW_AT_name        : (indirect string, offset: 0x76daa): htim8
    <715>   DW_AT_decl_file   : 1
    <716>   DW_AT_decl_line   : 11
    <717>   DW_AT_decl_column : 26
    <718>   DW_AT_type        : <0x6ff>
    <71c>   DW_AT_external    : 1
    <71c>   DW_AT_declaration : 1
 <1><71c>: Abbrev Number: 11 (DW_TAG_variable)
    <71d>   DW_AT_name        : (indirect string, offset: 0x29b91): IC_Val1
    <721>   DW_AT_decl_file   : 1
    <721>   DW_AT_decl_line   : 13
    <722>   DW_AT_decl_column : 10
    <723>   DW_AT_type        : <0xac>
    <727>   DW_AT_external    : 1
    <727>   DW_AT_location    : 5 byte block: 3 f4 1 0 20 	(DW_OP_addr: 200001f4)
 <1><72d>: Abbrev Number: 11 (DW_TAG_variable)
    <72e>   DW_AT_name        : (indirect string, offset: 0x29b99): IC_Val2
    <732>   DW_AT_decl_file   : 1
    <732>   DW_AT_decl_line   : 14
    <733>   DW_AT_decl_column : 10
    <734>   DW_AT_type        : <0xac>
    <738>   DW_AT_external    : 1
    <738>   DW_AT_location    : 5 byte block: 3 f8 1 0 20 	(DW_OP_addr: 200001f8)
 <1><73e>: Abbrev Number: 11 (DW_TAG_variable)
    <73f>   DW_AT_name        : (indirect string, offset: 0xa5180): Difference
    <743>   DW_AT_decl_file   : 1
    <743>   DW_AT_decl_line   : 15
    <744>   DW_AT_decl_column : 10
    <745>   DW_AT_type        : <0xac>
    <749>   DW_AT_external    : 1
    <749>   DW_AT_location    : 5 byte block: 3 fc 1 0 20 	(DW_OP_addr: 200001fc)
 <1><74f>: Abbrev Number: 11 (DW_TAG_variable)
    <750>   DW_AT_name        : (indirect string, offset: 0x8a6ea): Is_First_Captured
    <754>   DW_AT_decl_file   : 1
    <754>   DW_AT_decl_line   : 16
    <755>   DW_AT_decl_column : 9
    <756>   DW_AT_type        : <0x94>
    <75a>   DW_AT_external    : 1
    <75a>   DW_AT_location    : 5 byte block: 3 0 2 0 20 	(DW_OP_addr: 20000200)
 <1><760>: Abbrev Number: 11 (DW_TAG_variable)
    <761>   DW_AT_name        : (indirect string, offset: 0xd6d1d): Distance
    <765>   DW_AT_decl_file   : 1
    <765>   DW_AT_decl_line   : 17
    <766>   DW_AT_decl_column : 9
    <767>   DW_AT_type        : <0x94>
    <76b>   DW_AT_external    : 1
    <76b>   DW_AT_location    : 5 byte block: 3 1 2 0 20 	(DW_OP_addr: 20000201)
 <1><771>: Abbrev Number: 26 (DW_TAG_subprogram)
    <772>   DW_AT_external    : 1
    <772>   DW_AT_name        : (indirect string, offset: 0x22d5b): HAL_GPIO_WritePin
    <776>   DW_AT_decl_file   : 6
    <777>   DW_AT_decl_line   : 235
    <778>   DW_AT_decl_column : 6
    <779>   DW_AT_prototyped  : 1
    <779>   DW_AT_declaration : 1
    <779>   DW_AT_sibling     : <0x78d>
 <2><77d>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <77e>   DW_AT_type        : <0x78d>
 <2><782>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <783>   DW_AT_type        : <0xa0>
 <2><787>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <788>   DW_AT_type        : <0x32c>
 <2><78c>: Abbrev Number: 0
 <1><78d>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <78e>   DW_AT_byte_size   : 4
    <78e>   DW_AT_type        : <0x1b7>
 <1><792>: Abbrev Number: 27 (DW_TAG_subprogram)
    <793>   DW_AT_external    : 1
    <793>   DW_AT_name        : (indirect string, offset: 0x476c): HAL_TIM_ReadCapturedValue
    <797>   DW_AT_decl_file   : 8
    <798>   DW_AT_decl_line   : 2061
    <79a>   DW_AT_decl_column : 10
    <79b>   DW_AT_prototyped  : 1
    <79b>   DW_AT_type        : <0xac>
    <79f>   DW_AT_declaration : 1
    <79f>   DW_AT_sibling     : <0x7ae>
 <2><7a3>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <7a4>   DW_AT_type        : <0x7ae>
 <2><7a8>: Abbrev Number: 10 (DW_TAG_formal_parameter)
    <7a9>   DW_AT_type        : <0xac>
 <2><7ad>: Abbrev Number: 0
 <1><7ae>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <7af>   DW_AT_byte_size   : 4
    <7af>   DW_AT_type        : <0x70b>
 <1><7b3>: Abbrev Number: 28 (DW_TAG_subprogram)
    <7b4>   DW_AT_external    : 1
    <7b4>   DW_AT_name        : (indirect string, offset: 0xa9117): HCSR04_GetDis
    <7b8>   DW_AT_decl_file   : 1
    <7b9>   DW_AT_decl_line   : 61
    <7ba>   DW_AT_decl_column : 9
    <7bb>   DW_AT_prototyped  : 1
    <7bb>   DW_AT_type        : <0x94>
    <7bf>   DW_AT_low_pc      : 0x0
    <7c3>   DW_AT_high_pc     : 0x48
    <7c7>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7c9>   DW_AT_call_all_tail_calls: 1
 <1><7c9>: Abbrev Number: 29 (DW_TAG_subprogram)
    <7ca>   DW_AT_external    : 1
    <7ca>   DW_AT_name        : (indirect string, offset: 0xbab4f): delay
    <7ce>   DW_AT_decl_file   : 1
    <7cf>   DW_AT_decl_line   : 56
    <7d0>   DW_AT_decl_column : 6
    <7d1>   DW_AT_prototyped  : 1
    <7d1>   DW_AT_low_pc      : 0x0
    <7d5>   DW_AT_high_pc     : 0x34
    <7d9>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <7db>   DW_AT_call_all_calls: 1
    <7db>   DW_AT_sibling     : <0x7ee>
 <2><7df>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <7e0>   DW_AT_name        : (indirect string, offset: 0xd7b8f): time
    <7e4>   DW_AT_decl_file   : 1
    <7e4>   DW_AT_decl_line   : 56
    <7e5>   DW_AT_decl_column : 21
    <7e6>   DW_AT_type        : <0xa0>
    <7ea>   DW_AT_location    : 2 byte block: 91 76 	(DW_OP_fbreg: -10)
 <2><7ed>: Abbrev Number: 0
 <1><7ee>: Abbrev Number: 30 (DW_TAG_subprogram)
    <7ef>   DW_AT_external    : 1
    <7ef>   DW_AT_name        : (indirect string, offset: 0xc82a): HAL_TIM_IC_CaptureCallback
    <7f3>   DW_AT_decl_file   : 1
    <7f4>   DW_AT_decl_line   : 23
    <7f5>   DW_AT_decl_column : 6
    <7f6>   DW_AT_prototyped  : 1
    <7f6>   DW_AT_low_pc      : 0x8000ff0
    <7fa>   DW_AT_high_pc     : 0x140
    <7fe>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <800>   DW_AT_call_all_tail_calls: 1
    <800>   DW_AT_sibling     : <0x813>
 <2><804>: Abbrev Number: 18 (DW_TAG_formal_parameter)
    <805>   DW_AT_name        : (indirect string, offset: 0x98aed): htim
    <809>   DW_AT_decl_file   : 1
    <809>   DW_AT_decl_line   : 23
    <80a>   DW_AT_decl_column : 52
    <80b>   DW_AT_type        : <0x813>
    <80f>   DW_AT_location    : 2 byte block: 91 74 	(DW_OP_fbreg: -12)
 <2><812>: Abbrev Number: 0
 <1><813>: Abbrev Number: 8 (DW_TAG_pointer_type)
    <814>   DW_AT_byte_size   : 4
    <814>   DW_AT_type        : <0x6ff>
 <1><818>: Abbrev Number: 0
  Compilation Unit @ offset 0x819:
   Length:        0xfc (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x1de
   Pointer Size:  4
 <0><825>: Abbrev Number: 4 (DW_TAG_compile_unit)
    <826>   DW_AT_producer    : (indirect string, offset: 0xb3ef9): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <82a>   DW_AT_language    : 29	(C11)
    <82b>   DW_AT_name        : (indirect string, offset: 0xd6406): ../Core/Src/freertos.c
    <82f>   DW_AT_comp_dir    : (indirect string, offset: 0x85467): C:/Users/quocv/STM32CubeIDE/workspace_1.14.0/DA2/Debug
    <833>   DW_AT_ranges      : 0x2c
    <837>   DW_AT_low_pc      : 0x0
    <83b>   DW_AT_stmt_list   : 0x7dd
    <83f>   DW_AT_macros      : 0x1ecc3
 <1><843>: Abbrev Number: 5 (DW_TAG_base_type)
    <844>   DW_AT_byte_size   : 4
    <845>   DW_AT_encoding    : 5	(signed)
    <846>   DW_AT_name        : int
 <1><84a>: Abbrev Number: 1 (DW_TAG_base_type)
    <84b>   DW_AT_byte_size   : 4
    <84c>   DW_AT_encoding    : 7	(unsigned)
    <84d>   DW_AT_name        : (indirect string, offset: 0xf6b7): unsigned int
 <1><851>: Abbrev Number: 1 (DW_TAG_base_type)
    <852>   DW_AT_byte_size   : 8
    <853>   DW_AT_encoding    : 5	(signed)
    <854>   DW_AT_name        : (indirect string, offset: 0x59075): long long int
 <1><858>: Abbrev Number: 1 (DW_TAG_base_type)
    <859>   DW_AT_byte_size   : 8
    <85a>   DW_AT_encoding    : 4	(float)
    <85b>   DW_AT_name        : (indirect string, offset: 0xc5324): long double
 <1><85f>: Abbrev Number: 1 (DW_TAG_base_type)
    <860>   DW_AT_byte_size   : 1
    <861>   DW_AT_encoding    : 6	(signed char)
    <862>   DW_AT_name        : (indirect string, offset: 0x618c5): signed char
 <1><866>: Abbrev Number: 2 (DW_TAG_typedef)
    <867>   DW_AT_name        : (indirect string, offset: 0x39211): __uint8_t
    <86b>   DW_AT_decl_file   : 2
    <86c>   DW_AT_decl_line   : 43
    <86d>   DW_AT_decl_column : 24
    <86e>   DW_AT_type        : <0x872>
 <1><872>: Abbrev Number: 1 (DW_TAG_base_type)
    <873>   DW_AT_byte_size   : 1
    <874>   DW_AT_encoding    : 8	(unsigned char)
    <875>   DW_AT_name        : (indirect string, offset: 0xbbce9): unsigned char
 <1><879>: Abbrev Number: 1 (DW_TAG_base_type)
    <87a>   DW_AT_byte_size   : 2
    <87b>   DW_AT_encoding    : 5	(signed)
    <87c>   DW_AT_name        : (indirect string, offset: 0x90b96): short int
 <1><880>: Abbrev Number: 1 (DW_TAG_base_type)
    <881>   DW_AT_byte_size   : 2
    <882>   DW_AT_encoding    : 7	(unsigned)
    <883>   DW_AT_name        : (indirect string, offset: 0xba586): short unsigned int
 <1><887>: Abbrev Number: 1 (DW_TAG_base_type)
    <888>   DW_AT_byte_size   : 4
    <889>   DW_AT_encoding    : 5	(signed)
    <88a>   DW_AT_name        : (indirect string, offset: 0xffe4): long int
 <1><88e>: Abbrev Number: 1 (DW_TAG_base_type)
    <88f>   DW_AT_byte_size   : 4
    <890>   DW_AT_encoding    : 7	(unsigned)
    <891>   DW_AT_name        : (indirect string, offset: 0x4aab6): long unsigned int
 <1><895>: Abbrev Number: 1 (DW_TAG_base_type)
    <896>   DW_AT_byte_size   : 8
    <897>   DW_AT_encoding    : 7	(unsigned)
    <898>   DW_AT_name        : (indirect string, offset: 0x28f40): long long unsigned int
 <1><89c>: Abbrev Number: 2 (DW_TAG_typedef)
    <89d>   DW_AT_name        : (indirect string, offset: 0x39213): uint8_t
    <8a1>   DW_AT_decl_file   : 3
    <8a2>   DW_AT_decl_line   : 24
    <8a3>   DW_AT_decl_column : 19
    <8a4>   DW_AT_type        : <0x866>
 <1><8a8>: Abbrev Number: 3 (DW_TAG_const_type)
    <8a9>   DW_AT_type        : <0x89c>
 <1><8ad>: Abbrev Number: 1 (DW_TAG_base_type)
    <8ae>   DW_AT_byte_size   : 1
    <8af>   DW_AT_encoding    : 8	(unsigned char)
    <8b0>   DW_AT_name        : (indirect string, offset: 0xc9802): char
 <1><8b4>: Abbrev Number: 6 (DW_TAG_array_type)
    <8b5>   DW_AT_type        : <0x8a8>
    <8b9>   DW_AT_sibling     : <0x8c4>
 <2><8bd>: Abbrev Number: 7 (DW_TAG_subrange_type)
    <8be>   DW_AT_type        : <0x84a>
    <8c2>   DW_AT_upper_bound : 7
 <2><8c3>: Abbrev Number: 0
 <1><8c4>: Abbrev Number: 3 (DW_TAG_const_type)
    <8c5>   DW_AT_type        : <0x8b4>
 <1><8c9>: Abbrev Number: 8 (DW_TAG_variable)
    <8ca>   DW_AT_name        : (indirect string, offset: 0xc5500): STREAM_OFFSET_TAB
    <8ce>   DW_AT_decl_file   : 4
    <8cf>   DW_AT_decl_line   : 46
    <8d0>   DW_AT_decl_column : 22
    <8d1>   DW_AT_type        : <0x8c4>
    <8d5>   DW_AT_location    : 5 byte block: 3 0 0 0 0 	(DW_OP_addr: 0)
 <1><8db>: Abbrev Number: 1 (DW_TAG_base_type)
    <8dc>   DW_AT_byte_size   : 8
    <8dd>   DW_AT_encoding    : 4	(float)
    <8de>   DW_AT_name        : (indirect string, offset: 0xcf4af): double
 <1><8e2>: Abbrev Number: 1 (DW_TAG_base_type)
    <8e3>   DW_AT_byte_size   : 4
    <8e4>   DW_AT_encoding    : 4	(float)
    <8e5>   DW_AT_name        : (indirect string, offset: 0xc4e3f): float
 <1><8e9>: Abbrev Number: 1 (DW_TAG_base_type)
    <8ea>   DW_AT_byte_size   : 1
    <8eb>   DW_AT_encoding    : 2	(boolean)
    <8ec>   DW_AT_name        : (indirect string, offset: 0xcb1a0): _Bool
 <1><8f0>: Abbrev Number: 9 (DW_TAG_subprogram)
    <8f1>   DW_AT_external    : 1
    <8f1>   DW_AT_name        : (indirect string, offset: 0xcbdce): getRunTimeCounterValue
    <8f5>   DW_AT_decl_file   : 1
    <8f6>   DW_AT_decl_line   : 66
    <8f7>   DW_AT_decl_column : 22
    <8f8>   DW_AT_prototyped  : 1
    <8f8>   DW_AT_type        : <0x88e>
    <8fc>   DW_AT_low_pc      : 0x800113e
    <900>   DW_AT_high_pc     : 0x10
    <904>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <906>   DW_AT_call_all_calls: 1
 <1><906>: Abbrev Number: 10 (DW_TAG_subprogram)
    <907>   DW_AT_external    : 1
    <907>   DW_AT_name        : (indirect string, offset: 0xc73e6): configureTimerForRunTimeStats
    <90b>   DW_AT_decl_file   : 1
    <90c>   DW_AT_decl_line   : 61
    <90d>   DW_AT_decl_column : 13
    <90e>   DW_AT_prototyped  : 1
    <90e>   DW_AT_low_pc      : 0x8001130
    <912>   DW_AT_high_pc     : 0xe
    <916>   DW_AT_frame_base  : 1 byte block: 9c 	(DW_OP_call_frame_cfa)
    <918>   DW_AT_call_all_calls: 1
 <1><918>: Abbrev Number: 0
  Compilation Unit @ offset 0x919:
   Length:        0x2574 (32-bit)
   Version:       5
   Unit Type:     DW_UT_compile (1)
   Abbrev Offset: 0x277
   Pointer Size:  4
 <0><925>: Abbrev Number: 43 (DW_TAG_compile_unit)
    <926>   DW_AT_producer    : (indirect string, offset: 0xb3ef9): GNU C11 11.3.1 20220712 -mcpu=cortex-m4 -mfpu=fpv4-sp-d16 -mfloat-abi=hard -mthumb -march=armv7e-m+fp -g3 -O0 -std=gnu11 -ffunction-sections -fdata-sections -fstack-usage -fcyclomatic-complexity
    <92a>   DW_AT_language    : 29	(C11)
    <92b>   DW_AT_name        : (indirect string, offset: 0xd7b05): ../Core/Src/main.c
    <92f>   DW_AT_comp_dir    : (indirect string, offset: 0x85467): C:/Users/quocv/STM32CubeIDE/workspace_1.14.0/DA2/Debug
    <933>   DW_AT_ranges      : 0x45
    <937>   DW_AT_low_pc      : 0x0
    <93b>   DW_AT_stmt_list   : 0x137b
    <93f>   DW_AT_macros      : 0x1f2d2
 <1><943>: Abbrev Number: 23 (DW_TAG_enumeration_type)
    <944>   DW_AT_encoding    : 5	(signed)
    <945>   DW_AT_byte_size   : 1
    <946>   DW_AT_type        : <0xb68>
    <94a>   DW_AT_decl_file   : 6
    <94b>   DW_AT_decl_line   : 66
    <94c>   DW_AT_decl_column : 1
    <94d>   DW_AT_sibling     : <0xb68>
 <2><951>: Abbrev Number: 14 (DW_TAG_enumerator)
    <952>   DW_AT_name        : (indirect string, offset: 0xd6a32): NonMaskableInt_IRQn
    <956>   DW_AT_const_value : -14
 <2><957>: Abbrev Number: 14 (DW_TAG_enumerator)
    <958>   DW_AT_name        : (indirect string, offset: 0xd70bb): MemoryManagement_IRQn
    <95c>   DW_AT_const_value : -12
 <2><95d>: Abbrev Number: 14 (DW_TAG_enumerator)
    <95e>   DW_AT_name        : (indirect string, offset: 0xd7808): BusFault_IRQn
    <962>   DW_AT_const_value : -11
 <2><963>: Abbrev Number: 14 (DW_TAG_enumerator)
    <964>   DW_AT_name        : (indirect string, offset: 0xd755a): UsageFault_IRQn
    <968>   DW_AT_const_value : -10
 <2><969>: Abbrev Number: 14 (DW_TAG_enumerator)
    <96a>   DW_AT_name        : (indirect string, offset: 0xd6836): SVCall_IRQn
    <96e>   DW_AT_const_value : -5
 <2><96f>: Abbrev Number: 14 (DW_TAG_enumerator)
    <970>   DW_AT_name        : (indirect string, offset: 0xd70d1): DebugMonitor_IRQn
    <974>   DW_AT_const_value : -4
 <2><975>: Abbrev Number: 14 (DW_TAG_enumerator)
    <976>   DW_AT_name        : (indirect string, offset: 0xd7226): PendSV_IRQn
    <97a>   DW_AT_const_value : -2
 <2><97b>: Abbrev Number: 14 (DW_TAG_enumerator)
    <97c>   DW_AT_name        : (indirect string, offset: 0xd7873): SysTick_IRQn
    <980>   DW_AT_const_value : -1
 <2><981>: Abbrev Number: 1 (DW_TAG_enumerator)
    <982>   DW_AT_name        : (indirect string, offset: 0xd7660): WWDG_IRQn
    <986>   DW_AT_const_value : 0
 <2><987>: Abbrev Number: 1 (DW_TAG_enumerator)
    <988>   DW_AT_name        : (indirect string, offset: 0xd6a29): PVD_IRQn
    <98c>   DW_AT_const_value : 1
 <2><98d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <98e>   DW_AT_name        : (indirect string, offset: 0xd7ce3): TAMP_STAMP_IRQn
    <992>   DW_AT_const_value : 2
 <2><993>: Abbrev Number: 1 (DW_TAG_enumerator)
    <994>   DW_AT_name        : (indirect string, offset: 0xd7318): RTC_WKUP_IRQn
    <998>   DW_AT_const_value : 3
 <2><999>: Abbrev Number: 1 (DW_TAG_enumerator)
    <99a>   DW_AT_name        : (indirect string, offset: 0xd6c3e): FLASH_IRQn
    <99e>   DW_AT_const_value : 4
 <2><99f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a0>   DW_AT_name        : (indirect string, offset: 0xd77ff): RCC_IRQn
    <9a4>   DW_AT_const_value : 5
 <2><9a5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9a6>   DW_AT_name        : (indirect string, offset: 0xd70e3): EXTI0_IRQn
    <9aa>   DW_AT_const_value : 6
 <2><9ab>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ac>   DW_AT_name        : (indirect string, offset: 0xd7c47): EXTI1_IRQn
    <9b0>   DW_AT_const_value : 7
 <2><9b1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b2>   DW_AT_name        : (indirect string, offset: 0xd6ee3): EXTI2_IRQn
    <9b6>   DW_AT_const_value : 8
 <2><9b7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9b8>   DW_AT_name        : (indirect string, offset: 0xd7887): EXTI3_IRQn
    <9bc>   DW_AT_const_value : 9
 <2><9bd>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9be>   DW_AT_name        : (indirect string, offset: 0xd69fe): EXTI4_IRQn
    <9c2>   DW_AT_const_value : 10
 <2><9c3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9c4>   DW_AT_name        : (indirect string, offset: 0xd69be): DMA1_Stream0_IRQn
    <9c8>   DW_AT_const_value : 11
 <2><9c9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ca>   DW_AT_name        : (indirect string, offset: 0xd6fd2): DMA1_Stream1_IRQn
    <9ce>   DW_AT_const_value : 12
 <2><9cf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d0>   DW_AT_name        : (indirect string, offset: 0xd6f59): DMA1_Stream2_IRQn
    <9d4>   DW_AT_const_value : 13
 <2><9d5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9d6>   DW_AT_name        : (indirect string, offset: 0xd7aa1): DMA1_Stream3_IRQn
    <9da>   DW_AT_const_value : 14
 <2><9db>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9dc>   DW_AT_name        : (indirect string, offset: 0xd6d63): DMA1_Stream4_IRQn
    <9e0>   DW_AT_const_value : 15
 <2><9e1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9e2>   DW_AT_name        : (indirect string, offset: 0xd7779): DMA1_Stream5_IRQn
    <9e6>   DW_AT_const_value : 16
 <2><9e7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9e8>   DW_AT_name        : (indirect string, offset: 0xd6bc0): DMA1_Stream6_IRQn
    <9ec>   DW_AT_const_value : 17
 <2><9ed>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9ee>   DW_AT_name        : (indirect string, offset: 0xd7109): ADC_IRQn
    <9f2>   DW_AT_const_value : 18
 <2><9f3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9f4>   DW_AT_name        : (indirect string, offset: 0xd7b57): CAN1_TX_IRQn
    <9f8>   DW_AT_const_value : 19
 <2><9f9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <9fa>   DW_AT_name        : (indirect string, offset: 0xd6c13): CAN1_RX0_IRQn
    <9fe>   DW_AT_const_value : 20
 <2><9ff>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a00>   DW_AT_name        : (indirect string, offset: 0xd7583): CAN1_RX1_IRQn
    <a04>   DW_AT_const_value : 21
 <2><a05>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a06>   DW_AT_name        : (indirect string, offset: 0xd7575): CAN1_SCE_IRQn
    <a0a>   DW_AT_const_value : 22
 <2><a0b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a0c>   DW_AT_name        : (indirect string, offset: 0xd775b): EXTI9_5_IRQn
    <a10>   DW_AT_const_value : 23
 <2><a11>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a12>   DW_AT_name        : (indirect string, offset: 0xd6f1c): TIM1_BRK_TIM9_IRQn
    <a16>   DW_AT_const_value : 24
 <2><a17>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a18>   DW_AT_name        : (indirect string, offset: 0xd72d1): TIM1_UP_TIM10_IRQn
    <a1c>   DW_AT_const_value : 25
 <2><a1d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a1e>   DW_AT_name        : (indirect string, offset: 0xd6fa3): TIM1_TRG_COM_TIM11_IRQn
    <a22>   DW_AT_const_value : 26
 <2><a23>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a24>   DW_AT_name        : (indirect string, offset: 0xd702a): TIM1_CC_IRQn
    <a28>   DW_AT_const_value : 27
 <2><a29>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a2a>   DW_AT_name        : (indirect string, offset: 0xd6984): TIM2_IRQn
    <a2e>   DW_AT_const_value : 28
 <2><a2f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a30>   DW_AT_name        : (indirect string, offset: 0xd72bb): TIM3_IRQn
    <a34>   DW_AT_const_value : 29
 <2><a35>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a36>   DW_AT_name        : (indirect string, offset: 0xd6e20): TIM4_IRQn
    <a3a>   DW_AT_const_value : 30
 <2><a3b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a3c>   DW_AT_name        : (indirect string, offset: 0xd6e50): I2C1_EV_IRQn
    <a40>   DW_AT_const_value : 31
 <2><a41>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a42>   DW_AT_name        : (indirect string, offset: 0xd73e3): I2C1_ER_IRQn
    <a46>   DW_AT_const_value : 32
 <2><a47>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a48>   DW_AT_name        : (indirect string, offset: 0xd6964): I2C2_EV_IRQn
    <a4c>   DW_AT_const_value : 33
 <2><a4d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a4e>   DW_AT_name        : (indirect string, offset: 0xd6ecd): I2C2_ER_IRQn
    <a52>   DW_AT_const_value : 34
 <2><a53>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a54>   DW_AT_name        : (indirect string, offset: 0xd6971): SPI1_IRQn
    <a58>   DW_AT_const_value : 35
 <2><a59>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a5a>   DW_AT_name        : (indirect string, offset: 0xd72b1): SPI2_IRQn
    <a5e>   DW_AT_const_value : 36
 <2><a5f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a60>   DW_AT_name        : (indirect string, offset: 0xd782a): USART1_IRQn
    <a64>   DW_AT_const_value : 37
 <2><a65>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a66>   DW_AT_name        : (indirect string, offset: 0xd6c97): USART2_IRQn
    <a6a>   DW_AT_const_value : 38
 <2><a6b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a6c>   DW_AT_name        : (indirect string, offset: 0xd7675): USART3_IRQn
    <a70>   DW_AT_const_value : 39
 <2><a71>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a72>   DW_AT_name        : (indirect string, offset: 0xd791a): EXTI15_10_IRQn
    <a76>   DW_AT_const_value : 40
 <2><a77>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a78>   DW_AT_name        : (indirect string, offset: 0xd795e): RTC_Alarm_IRQn
    <a7c>   DW_AT_const_value : 41
 <2><a7d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a7e>   DW_AT_name        : (indirect string, offset: 0xd6c2d): OTG_FS_WKUP_IRQn
    <a82>   DW_AT_const_value : 42
 <2><a83>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a84>   DW_AT_name        : (indirect string, offset: 0xd785f): TIM8_BRK_TIM12_IRQn
    <a88>   DW_AT_const_value : 43
 <2><a89>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a8a>   DW_AT_name        : (indirect string, offset: 0xd76f4): TIM8_UP_TIM13_IRQn
    <a8e>   DW_AT_const_value : 44
 <2><a8f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a90>   DW_AT_name        : (indirect string, offset: 0xd7633): TIM8_TRG_COM_TIM14_IRQn
    <a94>   DW_AT_const_value : 45
 <2><a95>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a96>   DW_AT_name        : (indirect string, offset: 0xd7799): TIM8_CC_IRQn
    <a9a>   DW_AT_const_value : 46
 <2><a9b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <a9c>   DW_AT_name        : (indirect string, offset: 0xd7378): DMA1_Stream7_IRQn
    <aa0>   DW_AT_const_value : 47
 <2><aa1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa2>   DW_AT_name        : (indirect string, offset: 0x1d01c): FSMC_IRQn
    <aa6>   DW_AT_const_value : 48
 <2><aa7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aa8>   DW_AT_name        : (indirect string, offset: 0x42ba2): SDIO_IRQn
    <aac>   DW_AT_const_value : 49
 <2><aad>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aae>   DW_AT_name        : (indirect string, offset: 0xd6f89): TIM5_IRQn
    <ab2>   DW_AT_const_value : 50
 <2><ab3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ab4>   DW_AT_name        : (indirect string, offset: 0xd7d31): SPI3_IRQn
    <ab8>   DW_AT_const_value : 51
 <2><ab9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aba>   DW_AT_name        : (indirect string, offset: 0xd766a): UART4_IRQn
    <abe>   DW_AT_const_value : 52
 <2><abf>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ac0>   DW_AT_name        : (indirect string, offset: 0xd690b): UART5_IRQn
    <ac4>   DW_AT_const_value : 53
 <2><ac5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ac6>   DW_AT_name        : (indirect string, offset: 0xd7de7): TIM6_DAC_IRQn
    <aca>   DW_AT_const_value : 54
 <2><acb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <acc>   DW_AT_name        : (indirect string, offset: 0xd7136): TIM7_IRQn
    <ad0>   DW_AT_const_value : 55
 <2><ad1>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad2>   DW_AT_name        : (indirect string, offset: 0xd7605): DMA2_Stream0_IRQn
    <ad6>   DW_AT_const_value : 56
 <2><ad7>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ad8>   DW_AT_name        : (indirect string, offset: 0xd69a4): DMA2_Stream1_IRQn
    <adc>   DW_AT_const_value : 57
 <2><add>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ade>   DW_AT_name        : (indirect string, offset: 0xd719e): DMA2_Stream2_IRQn
    <ae2>   DW_AT_const_value : 58
 <2><ae3>: Abbrev Number: 1 (DW_TAG_enumerator)
    <ae4>   DW_AT_name        : (indirect string, offset: 0xd7a76): DMA2_Stream3_IRQn
    <ae8>   DW_AT_const_value : 59
 <2><ae9>: Abbrev Number: 1 (DW_TAG_enumerator)
    <aea>   DW_AT_name        : (indirect string, offset: 0xd6d75): DMA2_Stream4_IRQn
    <aee>   DW_AT_const_value : 60
 <2><aef>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af0>   DW_AT_name        : (indirect string, offset: 0xd6dbf): ETH_IRQn
    <af4>   DW_AT_const_value : 61
 <2><af5>: Abbrev Number: 1 (DW_TAG_enumerator)
    <af6>   DW_AT_name        : (indirect string, offset: 0xd6e7d): ETH_WKUP_IRQn
    <afa>   DW_AT_const_value : 62
 <2><afb>: Abbrev Number: 1 (DW_TAG_enumerator)
    <afc>   DW_AT_name        : (indirect string, offset: 0xd7118): CAN2_TX_IRQn
    <b00>   DW_AT_const_value : 63
 <2><b01>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b02>   DW_AT_name        : (indirect string, offset: 0xd6b46): CAN2_RX0_IRQn
    <b06>   DW_AT_const_value : 64
 <2><b07>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b08>   DW_AT_name        : (indirect string, offset: 0xd74d4): CAN2_RX1_IRQn
    <b0c>   DW_AT_const_value : 65
 <2><b0d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b0e>   DW_AT_name        : (indirect string, offset: 0xd7c2a): CAN2_SCE_IRQn
    <b12>   DW_AT_const_value : 66
 <2><b13>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b14>   DW_AT_name        : (indirect string, offset: 0xd72c5): OTG_FS_IRQn
    <b18>   DW_AT_const_value : 67
 <2><b19>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b1a>   DW_AT_name        : (indirect string, offset: 0xd7403): DMA2_Stream5_IRQn
    <b1e>   DW_AT_const_value : 68
 <2><b1f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b20>   DW_AT_name        : (indirect string, offset: 0xd6d93): DMA2_Stream6_IRQn
    <b24>   DW_AT_const_value : 69
 <2><b25>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b26>   DW_AT_name        : (indirect string, offset: 0xd77b6): DMA2_Stream7_IRQn
    <b2a>   DW_AT_const_value : 70
 <2><b2b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b2c>   DW_AT_name        : (indirect string, offset: 0xd6eee): USART6_IRQn
    <b30>   DW_AT_const_value : 71
 <2><b31>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b32>   DW_AT_name        : (indirect string, offset: 0xd7b24): I2C3_EV_IRQn
    <b36>   DW_AT_const_value : 72
 <2><b37>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b38>   DW_AT_name        : (indirect string, offset: 0xd6b14): I2C3_ER_IRQn
    <b3c>   DW_AT_const_value : 73
 <2><b3d>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b3e>   DW_AT_name        : (indirect string, offset: 0xd6e35): OTG_HS_EP1_OUT_IRQn
    <b42>   DW_AT_const_value : 74
 <2><b43>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b44>   DW_AT_name        : (indirect string, offset: 0xd76e1): OTG_HS_EP1_IN_IRQn
    <b48>   DW_AT_const_value : 75
 <2><b49>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b4a>   DW_AT_name        : (indirect string, offset: 0xd72a0): OTG_HS_WKUP_IRQn
    <b4e>   DW_AT_const_value : 76
 <2><b4f>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b50>   DW_AT_name        : (indirect string, offset: 0xd6f2f): OTG_HS_IRQn
    <b54>   DW_AT_const_value : 77
 <2><b55>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b56>   DW_AT_name        : (indirect string, offset: 0xd7bdb): DCMI_IRQn
    <b5a>   DW_AT_const_value : 78
 <2><b5b>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b5c>   DW_AT_name        : (indirect string, offset: 0xaf34c): RNG_IRQn
    <b60>   DW_AT_const_value : 80
 <2><b61>: Abbrev Number: 1 (DW_TAG_enumerator)
    <b62>   DW_AT_name        : (indirect string, offset: 0xd6df7): FPU_IRQn
    <b66>   DW_AT_const_value : 81
 <2><b67>: Abbrev Number: 0
 <1><b68>: Abbrev Number: 16 (DW_TAG_base_type)
    <b69>   DW_AT_byte_size   : 1
    <b6a>   DW_AT_encoding    : 6	(signed char)
    <b6b>   DW_AT_name        : (indirect string, offset: 0x618c5): signed char
 <1><b6f>: Abbrev Number: 5 (DW_TAG_typedef)
    <b70>   DW_AT_name        : (indirect string, offset: 0xd7a88): IRQn_Type
    <b74>   DW_AT_decl_file   : 6
    <b75>   DW_AT_decl_line   : 158
    <b76>   DW_AT_decl_column : 3
    <b77>   DW_AT_type        : <0x943>
 <1><b7b>: Abbrev Number: 5 (DW_TAG_typedef)
    <b7c>   DW_AT_name        : (indirect string, offset: 0xd68da): __int8_t
    <b80>   DW_AT_decl_file   : 7
    <b81>   DW_AT_decl_line   : 41
    <b82>   DW_AT_decl_column : 23
    <b83>   DW_AT_type        : <0xb68>
 <1><b87>: Abbrev Number: 5 (DW_TAG_typedef)
    <b88>   DW_AT_name        : (indirect string, offset: 0x39211): __uint8_t
    <b8c>   DW_AT_decl_file   : 7
    <b8d>   DW_AT_decl_line   : 43
    <b8e>   DW_AT_decl_column : 24
    <b8f>   DW_AT_type        : <0xb93>
 <1><b93>: Abbrev Number: 16 (DW_TAG_base_type)
    <b94>   DW_AT_byte_size   : 1
    <b95>   DW_AT_encoding    : 8	(unsigned char)
    <b96>   DW_AT_name        : (indirect string, offset: 0xbbce9): unsigned char
 <1><b9a>: Abbrev Number: 16 (DW_TAG_base_type)
    <b9b>   DW_AT_byte_size   : 2
    <b9c>   DW_AT_encoding    : 5	(signed)
    <b9d>   DW_AT_name        : (indirect string, offset: 0x90b96): short int
 <1><ba1>: Abbrev Number: 5 (DW_TAG_typedef)
    <ba2>   DW_AT_name        : (indirect string, offset: 0x9ea79): __uint16_t
    <ba6>   DW_AT_decl_file   : 7
    <ba7>   DW_AT_decl_line   : 57
    <ba8>   DW_AT_decl_column : 25
    <ba9>   DW_AT_type        : <0xbad>
 <1><bad>: Abbrev Number: 16 (DW_TAG_base_type)
    <bae>   DW_AT_byte_size   : 2
    <baf>   DW_AT_encoding    : 7	(unsigned)
    <bb0>   DW_AT_name        : (indirect string, offset: 0xba586): short unsigned int
 <1><bb4>: Abbrev Number: 5 (DW_TAG_typedef)
    <bb5>   DW_AT_name        : (indirect string, offset: 0xd73f0): __int32_t
    <bb9>   DW_AT_decl_file   : 7
    <bba>   DW_AT_decl_line   : 77
    <bbb>   DW_AT_decl_column : 24
    <bbc>   DW_AT_type        : <0xbc0>
 <1><bc0>: Abbrev Number: 16 (DW_TAG_base_type)
    <bc1>   DW_AT_byte_size   : 4
    <bc2>   DW_AT_encoding    : 5	(signed)
    <bc3>   DW_AT_name        : (indirect string, offset: 0xffe4): long int
 <1><bc7>: Abbrev Number: 5 (DW_TAG_typedef)
    <bc8>   DW_AT_name        : (indirect string, offset: 0x7bfc8): __uint32_t
    <bcc>   DW_AT_decl_file   : 7
    <bcd>   DW_AT_decl_line   : 79
    <bce>   DW_AT_decl_column : 25
    <bcf>   DW_AT_type        : <0xbd3>
 <1><bd3>: Abbrev Number: 16 (DW_TAG_base_type)
    <bd4>   DW_AT_byte_size   : 4
    <bd5>   DW_AT_encoding    : 7	(unsigned)
    <bd6>   DW_AT_name        : (indirect string, offset: 0x4aab6): long unsigned int
 <1><bda>: Abbrev Number: 16 (DW_TAG_base_type)
    <bdb>   DW_AT_byte_size   : 8
    <bdc>   DW_AT_encoding    : 5	(signed)
    <bdd>   DW_AT_name        : (indirect string, offset: 0x59075): long long int
 <1><be1>: Abbrev Number: 16 (DW_TAG_base_type)
    <be2>   DW_AT_byte_size   : 8
    <be3>   DW_AT_encoding    : 7	(unsigned)
    <be4>   DW_AT_name        : (indirect string, offset: 0x28f40): long long unsigned int
 <1><be8>: Abbrev Number: 44 (DW_TAG_base_type)
    <be9>   DW_AT_byte_size   : 4
    <bea>   DW_AT_encoding    : 5	(signed)
    <beb>   DW_AT_name        : int
 <1><bef>: Abbrev Number: 16 (DW_TAG_base_type)
    <bf0>   DW_AT_byte_size   : 4
    <bf1>   DW_AT_encoding    : 7	(unsigned)
    <bf2>   DW_AT_name        : (indirect string, offset: 0xf6b7): unsigned int
 <1><bf6>: Abbrev Number: 5 (DW_TAG_typedef)
    <bf7>   DW_AT_name        : (indirect string, offset: 0xd68dc): int8_t
    <bfb>   DW_AT_decl_file   : 8
    <bfc>   DW_AT_decl_line   : 20
    <bfd>   DW_AT_decl_column : 18
    <bfe>   DW_AT_type        : <0xb7b>
 <1><c02>: Abbrev Number: 5 (DW_TAG_typedef)
    <c03>   DW_AT_name        : (indirect string, offset: 0x39213): uint8_t
    <c07>   DW_AT_decl_file   : 8
    <c08>   DW_AT_decl_line   : 24
    <c09>   DW_AT_decl_column : 19
    <c0a>   DW_AT_type        : <0xb87>
 <1><c0e>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c0f>   DW_AT_type        : <0xc02>
 <1><c13>: Abbrev Number: 17 (DW_TAG_const_type)
    <c14>   DW_AT_type        : <0xc02>
 <1><c18>: Abbrev Number: 5 (DW_TAG_typedef)
    <c19>   DW_AT_name        : (indirect string, offset: 0xd0b8e): uint16_t
    <c1d>   DW_AT_decl_file   : 8
    <c1e>   DW_AT_decl_line   : 36
    <c1f>   DW_AT_decl_column : 20
    <c20>   DW_AT_type        : <0xba1>
 <1><c24>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c25>   DW_AT_type        : <0xc18>
 <1><c29>: Abbrev Number: 5 (DW_TAG_typedef)
    <c2a>   DW_AT_name        : (indirect string, offset: 0xd73f2): int32_t
    <c2e>   DW_AT_decl_file   : 8
    <c2f>   DW_AT_decl_line   : 44
    <c30>   DW_AT_decl_column : 19
    <c31>   DW_AT_type        : <0xbb4>
 <1><c35>: Abbrev Number: 5 (DW_TAG_typedef)
    <c36>   DW_AT_name        : (indirect string, offset: 0xd0af8): uint32_t
    <c3a>   DW_AT_decl_file   : 8
    <c3b>   DW_AT_decl_line   : 48
    <c3c>   DW_AT_decl_column : 20
    <c3d>   DW_AT_type        : <0xbc7>
 <1><c41>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <c42>   DW_AT_type        : <0xc35>
 <1><c46>: Abbrev Number: 17 (DW_TAG_const_type)
    <c47>   DW_AT_type        : <0xc41>
 <1><c4b>: Abbrev Number: 45 (DW_TAG_structure_type)
    <c4c>   DW_AT_byte_size   : 3588
    <c4e>   DW_AT_decl_file   : 1
    <c4f>   DW_AT_decl_line   : 411
    <c51>   DW_AT_decl_column : 9
    <c52>   DW_AT_sibling     : <0xd05>
 <2><c56>: Abbrev Number: 3 (DW_TAG_member)
    <c57>   DW_AT_name        : (indirect string, offset: 0xd70a9): ISER
    <c5b>   DW_AT_decl_file   : 1
    <c5c>   DW_AT_decl_line   : 413
    <c5e>   DW_AT_decl_column : 18
    <c5f>   DW_AT_type        : <0xd15>
    <c63>   DW_AT_data_member_location: 0
 <2><c64>: Abbrev Number: 3 (DW_TAG_member)
    <c65>   DW_AT_name        : (indirect string, offset: 0xd7bee): RESERVED0
    <c69>   DW_AT_decl_file   : 1
    <c6a>   DW_AT_decl_line   : 414
    <c6c>   DW_AT_decl_column : 18
    <c6d>   DW_AT_type        : <0xd1a>
    <c71>   DW_AT_data_member_location: 32
 <2><c72>: Abbrev Number: 3 (DW_TAG_member)
    <c73>   DW_AT_name        : (indirect string, offset: 0xd7a12): ICER
    <c77>   DW_AT_decl_file   : 1
    <c78>   DW_AT_decl_line   : 415
    <c7a>   DW_AT_decl_column : 18
    <c7b>   DW_AT_type        : <0xd15>
    <c7f>   DW_AT_data_member_location: 128
 <2><c80>: Abbrev Number: 3 (DW_TAG_member)
    <c81>   DW_AT_name        : (indirect string, offset: 0xd7bf8): RESERVED1
    <c85>   DW_AT_decl_file   : 1
    <c86>   DW_AT_decl_line   : 416
    <c88>   DW_AT_decl_column : 18
    <c89>   DW_AT_type        : <0xd1a>
    <c8d>   DW_AT_data_member_location: 160
 <2><c8e>: Abbrev Number: 25 (DW_TAG_member)
    <c8f>   DW_AT_name        : (indirect string, offset: 0xd7140): ISPR
    <c93>   DW_AT_decl_file   : 1
    <c93>   DW_AT_decl_line   : 417
    <c95>   DW_AT_decl_column : 18
    <c95>   DW_AT_type        : <0xd15>
    <c99>   DW_AT_data_member_location: 256
 <2><c9b>: Abbrev Number: 25 (DW_TAG_member)
    <c9c>   DW_AT_name        : (indirect string, offset: 0xd7c02): RESERVED2
    <ca0>   DW_AT_decl_file   : 1
    <ca0>   DW_AT_decl_line   : 418
    <ca2>   DW_AT_decl_column : 18
    <ca2>   DW_AT_type        : <0xd1a>
    <ca6>   DW_AT_data_member_location: 288
 <2><ca8>: Abbrev Number: 25 (DW_TAG_member)
    <ca9>   DW_AT_name        : (indirect string, offset: 0xd6ddf): ICPR
    <cad>   DW_AT_decl_file   : 1
    <cad>   DW_AT_decl_line   : 419
    <caf>   DW_AT_decl_column : 18
    <caf>   DW_AT_type        : <0xd15>
    <cb3>   DW_AT_data_member_location: 384
 <2><cb5>: Abbrev Number: 25 (DW_TAG_member)
    <cb6>   DW_AT_name        : (indirect string, offset: 0xd7c0c): RESERVED3
    <cba>   DW_AT_decl_file   : 1
    <cba>   DW_AT_decl_line   : 420
    <cbc>   DW_AT_decl_column : 18
    <cbc>   DW_AT_type        : <0xd1a>
    <cc0>   DW_AT_data_member_location: 416
 <2><cc2>: Abbrev Number: 25 (DW_TAG_member)
    <cc3>   DW_AT_name        : (indirect string, offset: 0xd6854): IABR
    <cc7>   DW_AT_decl_file   : 1
    <cc7>   DW_AT_decl_line   : 421
    <cc9>   DW_AT_decl_column : 18
    <cc9>   DW_AT_type        : <0xd15>
    <ccd>   DW_AT_data_member_location: 512
 <2><ccf>: Abbrev Number: 25 (DW_TAG_member)
    <cd0>   DW_AT_name        : (indirect string, offset: 0xd7c16): RESERVED4
    <cd4>   DW_AT_decl_file   : 1
    <cd4>   DW_AT_decl_line   : 422
    <cd6>   DW_AT_decl_column : 18
    <cd6>   DW_AT_type        : <0xd2a>
    <cda>   DW_AT_data_member_location: 544
 <2><cdc>: Abbrev Number: 46 (DW_TAG_member)
    <cdd>   DW_AT_name        : IP
    <ce0>   DW_AT_decl_file   : 1
    <ce1>   DW_AT_decl_line   : 423
    <ce3>   DW_AT_decl_column : 18
    <ce4>   DW_AT_type        : <0xd4a>
    <ce8>   DW_AT_data_member_location: 768
 <2><cea>: Abbrev Number: 25 (DW_TAG_member)
    <ceb>   DW_AT_name        : (indirect string, offset: 0xd7c20): RESERVED5
    <cef>   DW_AT_decl_file   : 1
    <cef>   DW_AT_decl_line   : 424
    <cf1>   DW_AT_decl_column : 18
    <cf1>   DW_AT_type        : <0xd4f>
    <cf5>   DW_AT_data_member_location: 1008
 <2><cf7>: Abbrev Number: 25 (DW_TAG_member)
    <cf8>   DW_AT_name        : (indirect string, offset: 0xd7063): STIR
    <cfc>   DW_AT_decl_file   : 1
    <cfc>   DW_AT_decl_line   : 425
    <cfe>   DW_AT_decl_column : 18
    <cfe>   DW_AT_type        : <0xc41>
    <d02>   DW_AT_data_member_location: 3584
 <2><d04>: Abbrev Number: 0
 <1><d05>: Abbrev Number: 13 (DW_TAG_array_type)
    <d06>   DW_AT_type        : <0xc41>
    <d0a>   DW_AT_sibling     : <0xd15>
 <2><d0e>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d0f>   DW_AT_type        : <0xbef>
    <d13>   DW_AT_upper_bound : 7
 <2><d14>: Abbrev Number: 0
 <1><d15>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d16>   DW_AT_type        : <0xd05>
 <1><d1a>: Abbrev Number: 13 (DW_TAG_array_type)
    <d1b>   DW_AT_type        : <0xc35>
    <d1f>   DW_AT_sibling     : <0xd2a>
 <2><d23>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d24>   DW_AT_type        : <0xbef>
    <d28>   DW_AT_upper_bound : 23
 <2><d29>: Abbrev Number: 0
 <1><d2a>: Abbrev Number: 13 (DW_TAG_array_type)
    <d2b>   DW_AT_type        : <0xc35>
    <d2f>   DW_AT_sibling     : <0xd3a>
 <2><d33>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d34>   DW_AT_type        : <0xbef>
    <d38>   DW_AT_upper_bound : 55
 <2><d39>: Abbrev Number: 0
 <1><d3a>: Abbrev Number: 13 (DW_TAG_array_type)
    <d3b>   DW_AT_type        : <0xc0e>
    <d3f>   DW_AT_sibling     : <0xd4a>
 <2><d43>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <d44>   DW_AT_type        : <0xbef>
    <d48>   DW_AT_upper_bound : 239
 <2><d49>: Abbrev Number: 0
 <1><d4a>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <d4b>   DW_AT_type        : <0xd3a>
 <1><d4f>: Abbrev Number: 13 (DW_TAG_array_type)
    <d50>   DW_AT_type        : <0xc35>
    <d54>   DW_AT_sibling     : <0xd60>
 <2><d58>: Abbrev Number: 47 (DW_TAG_subrange_type)
    <d59>   DW_AT_type        : <0xbef>
    <d5d>   DW_AT_upper_bound : 643
 <2><d5f>: Abbrev Number: 0
 <1><d60>: Abbrev Number: 18 (DW_TAG_typedef)
    <d61>   DW_AT_name        : (indirect string, offset: 0xd706e): NVIC_Type
    <d65>   DW_AT_decl_file   : 1
    <d66>   DW_AT_decl_line   : 426
    <d68>   DW_AT_decl_column : 4
    <d69>   DW_AT_type        : <0xc4b>
 <1><d6d>: Abbrev Number: 24 (DW_TAG_structure_type)
    <d6e>   DW_AT_byte_size   : 140
    <d6f>   DW_AT_decl_file   : 1
    <d70>   DW_AT_decl_line   : 445
    <d72>   DW_AT_decl_column : 9
    <d72>   DW_AT_sibling     : <0xe9d>
 <2><d76>: Abbrev Number: 3 (DW_TAG_member)
    <d77>   DW_AT_name        : (indirect string, offset: 0xd6e00): CPUID
    <d7b>   DW_AT_decl_file   : 1
    <d7c>   DW_AT_decl_line   : 447
    <d7e>   DW_AT_decl_column : 18
    <d7f>   DW_AT_type        : <0xc46>
    <d83>   DW_AT_data_member_location: 0
 <2><d84>: Abbrev Number: 3 (DW_TAG_member)
    <d85>   DW_AT_name        : (indirect string, offset: 0xd6df2): ICSR
    <d89>   DW_AT_decl_file   : 1
    <d8a>   DW_AT_decl_line   : 448
    <d8c>   DW_AT_decl_column : 18
    <d8d>   DW_AT_type        : <0xc41>
    <d91>   DW_AT_data_member_location: 4
 <2><d92>: Abbrev Number: 3 (DW_TAG_member)
    <d93>   DW_AT_name        : (indirect string, offset: 0xd6892): VTOR
    <d97>   DW_AT_decl_file   : 1
    <d98>   DW_AT_decl_line   : 449
    <d9a>   DW_AT_decl_column : 18
    <d9b>   DW_AT_type        : <0xc41>
    <d9f>   DW_AT_data_member_location: 8
 <2><da0>: Abbrev Number: 3 (DW_TAG_member)
    <da1>   DW_AT_name        : (indirect string, offset: 0xd69eb): AIRCR
    <da5>   DW_AT_decl_file   : 1
    <da6>   DW_AT_decl_line   : 450
    <da8>   DW_AT_decl_column : 18
    <da9>   DW_AT_type        : <0xc41>
    <dad>   DW_AT_data_member_location: 12
 <2><dae>: Abbrev Number: 6 (DW_TAG_member)
    <daf>   DW_AT_name        : SCR
    <db3>   DW_AT_decl_file   : 1
    <db4>   DW_AT_decl_line   : 451
    <db6>   DW_AT_decl_column : 18
    <db7>   DW_AT_type        : <0xc41>
    <dbb>   DW_AT_data_member_location: 16
 <2><dbc>: Abbrev Number: 6 (DW_TAG_member)
    <dbd>   DW_AT_name        : CCR
    <dc1>   DW_AT_decl_file   : 1
    <dc2>   DW_AT_decl_line   : 452
    <dc4>   DW_AT_decl_column : 18
    <dc5>   DW_AT_type        : <0xc41>
    <dc9>   DW_AT_data_member_location: 20
 <2><dca>: Abbrev Number: 6 (DW_TAG_member)
    <dcb>   DW_AT_name        : SHP
    <dcf>   DW_AT_decl_file   : 1
    <dd0>   DW_AT_decl_line   : 453
    <dd2>   DW_AT_decl_column : 18
    <dd3>   DW_AT_type        : <0xead>
    <dd7>   DW_AT_data_member_location: 24
 <2><dd8>: Abbrev Number: 3 (DW_TAG_member)
    <dd9>   DW_AT_name        : (indirect string, offset: 0xd71c9): SHCSR
    <ddd>   DW_AT_decl_file   : 1
    <dde>   DW_AT_decl_line   : 454
    <de0>   DW_AT_decl_column : 18
    <de1>   DW_AT_type        : <0xc41>
    <de5>   DW_AT_data_member_location: 36
 <2><de6>: Abbrev Number: 3 (DW_TAG_member)
    <de7>   DW_AT_name        : (indirect string, offset: 0xd6cdc): CFSR
    <deb>   DW_AT_decl_file   : 1
    <dec>   DW_AT_decl_line   : 455
    <dee>   DW_AT_decl_column : 18
    <def>   DW_AT_type        : <0xc41>
    <df3>   DW_AT_data_member_location: 40
 <2><df4>: Abbrev Number: 3 (DW_TAG_member)
    <df5>   DW_AT_name        : (indirect string, offset: 0xd7248): HFSR
    <df9>   DW_AT_decl_file   : 1
    <dfa>   DW_AT_decl_line   : 456
    <dfc>   DW_AT_decl_column : 18
    <dfd>   DW_AT_type        : <0xc41>
    <e01>   DW_AT_data_member_location: 44
 <2><e02>: Abbrev Number: 3 (DW_TAG_member)
    <e03>   DW_AT_name        : (indirect string, offset: 0xd6eff): DFSR
    <e07>   DW_AT_decl_file   : 1
    <e08>   DW_AT_decl_line   : 457
    <e0a>   DW_AT_decl_column : 18
    <e0b>   DW_AT_type        : <0xc41>
    <e0f>   DW_AT_data_member_location: 48
 <2><e10>: Abbrev Number: 3 (DW_TAG_member)
    <e11>   DW_AT_name        : (indirect string, offset: 0xd7b94): MMFAR
    <e15>   DW_AT_decl_file   : 1
    <e16>   DW_AT_decl_line   : 458
    <e18>   DW_AT_decl_column : 18
    <e19>   DW_AT_type        : <0xc41>
    <e1d>   DW_AT_data_member_location: 52
 <2><e1e>: Abbrev Number: 3 (DW_TAG_member)
    <e1f>   DW_AT_name        : (indirect string, offset: 0xd6f17): BFAR
    <e23>   DW_AT_decl_file   : 1
    <e24>   DW_AT_decl_line   : 459
    <e26>   DW_AT_decl_column : 18
    <e27>   DW_AT_type        : <0xc41>
    <e2b>   DW_AT_data_member_location: 56
 <2><e2c>: Abbrev Number: 3 (DW_TAG_member)
    <e2d>   DW_AT_name        : (indirect string, offset: 0xd6cd1): AFSR
    <e31>   DW_AT_decl_file   : 1
    <e32>   DW_AT_decl_line   : 460
    <e34>   DW_AT_decl_column : 18
    <e35>   DW_AT_type        : <0xc41>
    <e39>   DW_AT_data_member_location: 60
 <2><e3a>: Abbrev Number: 6 (DW_TAG_member)
    <e3b>   DW_AT_name        : PFR
    <e3f>   DW_AT_decl_file   : 1
    <e40>   DW_AT_decl_line   : 461
    <e42>   DW_AT_decl_column : 18
    <e43>   DW_AT_type        : <0xec7>
    <e47>   DW_AT_data_member_location: 64
 <2><e48>: Abbrev Number: 6 (DW_TAG_member)
    <e49>   DW_AT_name        : DFR
    <e4d>   DW_AT_decl_file   : 1
    <e4e>   DW_AT_decl_line   : 462
    <e50>   DW_AT_decl_column : 18
    <e51>   DW_AT_type        : <0xc46>
    <e55>   DW_AT_data_member_location: 72
 <2><e56>: Abbrev Number: 6 (DW_TAG_member)
    <e57>   DW_AT_name        : ADR
    <e5b>   DW_AT_decl_file   : 1
    <e5c>   DW_AT_decl_line   : 463
    <e5e>   DW_AT_decl_column : 18
    <e5f>   DW_AT_type        : <0xc46>
    <e63>   DW_AT_data_member_location: 76
 <2><e64>: Abbrev Number: 3 (DW_TAG_member)
    <e65>   DW_AT_name        : (indirect string, offset: 0xd6efa): MMFR
    <e69>   DW_AT_decl_file   : 1
    <e6a>   DW_AT_decl_line   : 464
    <e6c>   DW_AT_decl_column : 18
    <e6d>   DW_AT_type        : <0xee1>
    <e71>   DW_AT_data_member_location: 80
 <2><e72>: Abbrev Number: 3 (DW_TAG_member)
    <e73>   DW_AT_name        : (indirect string, offset: 0xd7083): ISAR
    <e77>   DW_AT_decl_file   : 1
    <e78>   DW_AT_decl_line   : 465
    <e7a>   DW_AT_decl_column : 18
    <e7b>   DW_AT_type        : <0xefb>
    <e7f>   DW_AT_data_member_location: 96
 <2><e80>: Abbrev Number: 3 (DW_TAG_member)
    <e81>   DW_AT_name        : (indirect string, offset: 0xd7bee): RESERVED0
    <e85>   DW_AT_decl_file   : 1
    <e86>   DW_AT_decl_line   : 466
    <e88>   DW_AT_decl_column : 18
    <e89>   DW_AT_type        : <0xf00>
    <e8d>   DW_AT_data_member_location: 116
 <2><e8e>: Abbrev Number: 3 (DW_TAG_member)
    <e8f>   DW_AT_name        : (indirect string, offset: 0xd6f04): CPACR
    <e93>   DW_AT_decl_file   : 1
    <e94>   DW_AT_decl_line   : 467
    <e96>   DW_AT_decl_column : 18
    <e97>   DW_AT_type        : <0xc41>
    <e9b>   DW_AT_data_member_location: 136
 <2><e9c>: Abbrev Number: 0
 <1><e9d>: Abbrev Number: 13 (DW_TAG_array_type)
    <e9e>   DW_AT_type        : <0xc0e>
    <ea2>   DW_AT_sibling     : <0xead>
 <2><ea6>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ea7>   DW_AT_type        : <0xbef>
    <eab>   DW_AT_upper_bound : 11
 <2><eac>: Abbrev Number: 0
 <1><ead>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <eae>   DW_AT_type        : <0xe9d>
 <1><eb2>: Abbrev Number: 13 (DW_TAG_array_type)
    <eb3>   DW_AT_type        : <0xc46>
    <eb7>   DW_AT_sibling     : <0xec2>
 <2><ebb>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ebc>   DW_AT_type        : <0xbef>
    <ec0>   DW_AT_upper_bound : 1
 <2><ec1>: Abbrev Number: 0
 <1><ec2>: Abbrev Number: 17 (DW_TAG_const_type)
    <ec3>   DW_AT_type        : <0xeb2>
 <1><ec7>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ec8>   DW_AT_type        : <0xec2>
 <1><ecc>: Abbrev Number: 13 (DW_TAG_array_type)
    <ecd>   DW_AT_type        : <0xc46>
    <ed1>   DW_AT_sibling     : <0xedc>
 <2><ed5>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ed6>   DW_AT_type        : <0xbef>
    <eda>   DW_AT_upper_bound : 3
 <2><edb>: Abbrev Number: 0
 <1><edc>: Abbrev Number: 17 (DW_TAG_const_type)
    <edd>   DW_AT_type        : <0xecc>
 <1><ee1>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <ee2>   DW_AT_type        : <0xedc>
 <1><ee6>: Abbrev Number: 13 (DW_TAG_array_type)
    <ee7>   DW_AT_type        : <0xc46>
    <eeb>   DW_AT_sibling     : <0xef6>
 <2><eef>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <ef0>   DW_AT_type        : <0xbef>
    <ef4>   DW_AT_upper_bound : 4
 <2><ef5>: Abbrev Number: 0
 <1><ef6>: Abbrev Number: 17 (DW_TAG_const_type)
    <ef7>   DW_AT_type        : <0xee6>
 <1><efb>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <efc>   DW_AT_type        : <0xef6>
 <1><f00>: Abbrev Number: 13 (DW_TAG_array_type)
    <f01>   DW_AT_type        : <0xc35>
    <f05>   DW_AT_sibling     : <0xf10>
 <2><f09>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <f0a>   DW_AT_type        : <0xbef>
    <f0e>   DW_AT_upper_bound : 4
 <2><f0f>: Abbrev Number: 0
 <1><f10>: Abbrev Number: 18 (DW_TAG_typedef)
    <f11>   DW_AT_name        : (indirect string, offset: 0xd7768): SCB_Type
    <f15>   DW_AT_decl_file   : 1
    <f16>   DW_AT_decl_line   : 468
    <f18>   DW_AT_decl_column : 3
    <f19>   DW_AT_type        : <0xd6d>
 <1><f1d>: Abbrev Number: 13 (DW_TAG_array_type)
    <f1e>   DW_AT_type        : <0xc35>
    <f22>   DW_AT_sibling     : <0xf2d>
 <2><f26>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <f27>   DW_AT_type        : <0xbef>
    <f2b>   DW_AT_upper_bound : 1
 <2><f2c>: Abbrev Number: 0
 <1><f2d>: Abbrev Number: 13 (DW_TAG_array_type)
    <f2e>   DW_AT_type        : <0xc13>
    <f32>   DW_AT_sibling     : <0xf3d>
 <2><f36>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <f37>   DW_AT_type        : <0xbef>
    <f3b>   DW_AT_upper_bound : 7
 <2><f3c>: Abbrev Number: 0
 <1><f3d>: Abbrev Number: 17 (DW_TAG_const_type)
    <f3e>   DW_AT_type        : <0xf2d>
 <1><f42>: Abbrev Number: 24 (DW_TAG_structure_type)
    <f43>   DW_AT_byte_size   : 24
    <f44>   DW_AT_decl_file   : 6
    <f45>   DW_AT_decl_line   : 345
    <f47>   DW_AT_decl_column : 9
    <f47>   DW_AT_sibling     : <0xf9f>
 <2><f4b>: Abbrev Number: 6 (DW_TAG_member)
    <f4c>   DW_AT_name        : CR
    <f4f>   DW_AT_decl_file   : 6
    <f50>   DW_AT_decl_line   : 347
    <f52>   DW_AT_decl_column : 17
    <f53>   DW_AT_type        : <0xc41>
    <f57>   DW_AT_data_member_location: 0
 <2><f58>: Abbrev Number: 3 (DW_TAG_member)
    <f59>   DW_AT_name        : (indirect string, offset: 0x4a352): NDTR
    <f5d>   DW_AT_decl_file   : 6
    <f5e>   DW_AT_decl_line   : 348
    <f60>   DW_AT_decl_column : 17
    <f61>   DW_AT_type        : <0xc41>
    <f65>   DW_AT_data_member_location: 4
 <2><f66>: Abbrev Number: 6 (DW_TAG_member)
    <f67>   DW_AT_name        : PAR
    <f6b>   DW_AT_decl_file   : 6
    <f6c>   DW_AT_decl_line   : 349
    <f6e>   DW_AT_decl_column : 17
    <f6f>   DW_AT_type        : <0xc41>
    <f73>   DW_AT_data_member_location: 8
 <2><f74>: Abbrev Number: 3 (DW_TAG_member)
    <f75>   DW_AT_name        : (indirect string, offset: 0x5110e): M0AR
    <f79>   DW_AT_decl_file   : 6
    <f7a>   DW_AT_decl_line   : 350
    <f7c>   DW_AT_decl_column : 17
    <f7d>   DW_AT_type        : <0xc41>
    <f81>   DW_AT_data_member_location: 12
 <2><f82>: Abbrev Number: 3 (DW_TAG_member)
    <f83>   DW_AT_name        : (indirect string, offset: 0x6bdcf): M1AR
    <f87>   DW_AT_decl_file   : 6
    <f88>   DW_AT_decl_line   : 351
    <f8a>   DW_AT_decl_column : 17
    <f8b>   DW_AT_type        : <0xc41>
    <f8f>   DW_AT_data_member_location: 16
 <2><f90>: Abbrev Number: 6 (DW_TAG_member)
    <f91>   DW_AT_name        : FCR
    <f95>   DW_AT_decl_file   : 6
    <f96>   DW_AT_decl_line   : 352
    <f98>   DW_AT_decl_column : 17
    <f99>   DW_AT_type        : <0xc41>
    <f9d>   DW_AT_data_member_location: 20
 <2><f9e>: Abbrev Number: 0
 <1><f9f>: Abbrev Number: 18 (DW_TAG_typedef)
    <fa0>   DW_AT_name        : (indirect string, offset: 0xb0897): DMA_Stream_TypeDef
    <fa4>   DW_AT_decl_file   : 6
    <fa5>   DW_AT_decl_line   : 353
    <fa7>   DW_AT_decl_column : 3
    <fa8>   DW_AT_type        : <0xf42>
 <1><fac>: Abbrev Number: 24 (DW_TAG_structure_type)
    <fad>   DW_AT_byte_size   : 40
    <fae>   DW_AT_decl_file   : 6
    <faf>   DW_AT_decl_line   : 526
    <fb1>   DW_AT_decl_column : 9
    <fb1>   DW_AT_sibling     : <0x1034>
 <2><fb5>: Abbrev Number: 3 (DW_TAG_member)
    <fb6>   DW_AT_name        : (indirect string, offset: 0x7e868): MODER
    <fba>   DW_AT_decl_file   : 6
    <fbb>   DW_AT_decl_line   : 528
    <fbd>   DW_AT_decl_column : 17
    <fbe>   DW_AT_type        : <0xc41>
    <fc2>   DW_AT_data_member_location: 0
 <2><fc3>: Abbrev Number: 3 (DW_TAG_member)
    <fc4>   DW_AT_name        : (indirect string, offset: 0x96505): OTYPER
    <fc8>   DW_AT_decl_file   : 6
    <fc9>   DW_AT_decl_line   : 529
    <fcb>   DW_AT_decl_column : 17
    <fcc>   DW_AT_type        : <0xc41>
    <fd0>   DW_AT_data_member_location: 4
 <2><fd1>: Abbrev Number: 3 (DW_TAG_member)
    <fd2>   DW_AT_name        : (indirect string, offset: 0xa910f): OSPEEDR
    <fd6>   DW_AT_decl_file   : 6
    <fd7>   DW_AT_decl_line   : 530
    <fd9>   DW_AT_decl_column : 17
    <fda>   DW_AT_type        : <0xc41>
    <fde>   DW_AT_data_member_location: 8
 <2><fdf>: Abbrev Number: 3 (DW_TAG_member)
    <fe0>   DW_AT_name        : (indirect string, offset: 0x70c0e): PUPDR
    <fe4>   DW_AT_decl_file   : 6
    <fe5>   DW_AT_decl_line   : 531
    <fe7>   DW_AT_decl_column : 17
    <fe8>   DW_AT_type        : <0xc41>
    <fec>   DW_AT_data_member_location: 12
 <2><fed>: Abbrev Number: 6 (DW_TAG_member)
    <fee>   DW_AT_name        : IDR
    <ff2>   DW_AT_decl_file   : 6
    <ff3>   DW_AT_decl_line   : 532
    <ff5>   DW_AT_decl_column : 17
    <ff6>   DW_AT_type        : <0xc41>
    <ffa>   DW_AT_data_member_location: 16
 <2><ffb>: Abbrev Number: 6 (DW_TAG_member)
    <ffc>   DW_AT_name        : ODR
    <1000>   DW_AT_decl_file   : 6
    <1001>   DW_AT_decl_line   : 533
    <1003>   DW_AT_decl_column : 17
    <1004>   DW_AT_type        : <0xc41>
    <1008>   DW_AT_data_member_location: 20
 <2><1009>: Abbrev Number: 3 (DW_TAG_member)
    <100a>   DW_AT_name        : (indirect string, offset: 0x2c4a3): BSRR
    <100e>   DW_AT_decl_file   : 6
    <100f>   DW_AT_decl_line   : 534
    <1011>   DW_AT_decl_column : 17
    <1012>   DW_AT_type        : <0xc41>
    <1016>   DW_AT_data_member_location: 24
 <2><1017>: Abbrev Number: 3 (DW_TAG_member)
    <1018>   DW_AT_name        : (indirect string, offset: 0xa6937): LCKR
    <101c>   DW_AT_decl_file   : 6
    <101d>   DW_AT_decl_line   : 535
    <101f>   DW_AT_decl_column : 17
    <1020>   DW_AT_type        : <0xc41>
    <1024>   DW_AT_data_member_location: 28
 <2><1025>: Abbrev Number: 6 (DW_TAG_member)
    <1026>   DW_AT_name        : AFR
    <102a>   DW_AT_decl_file   : 6
    <102b>   DW_AT_decl_line   : 536
    <102d>   DW_AT_decl_column : 17
    <102e>   DW_AT_type        : <0x1044>
    <1032>   DW_AT_data_member_location: 32
 <2><1033>: Abbrev Number: 0
 <1><1034>: Abbrev Number: 13 (DW_TAG_array_type)
    <1035>   DW_AT_type        : <0xc41>
    <1039>   DW_AT_sibling     : <0x1044>
 <2><103d>: Abbrev Number: 15 (DW_TAG_subrange_type)
    <103e>   DW_AT_type        : <0xbef>
    <1042>   DW_AT_upper_bound : 1
 <2><1043>: Abbrev Number: 0
 <1><1044>: Abbrev Number: 12 (DW_TAG_volatile_type)
    <1045>   DW_AT_type        : <0x1034>
 <1><1049>: Abbrev Number: 18 (DW_TAG_typedef)
    <104a>   DW_AT_name        : (indirect string, offset: 0xbcddf): GPIO_TypeDef
    <104e>   DW_AT_decl_file   : 6
    <104f>   DW_AT_decl_line   : 537
    <1051>   DW_AT_decl_column : 3
    <1052>   DW_AT_type        : <0xfac>
 <1><1056>: Abbrev Number: 24 (DW_TAG_structure_type)
    <1057>   DW_AT_byte_size   : 8
    <1058>   DW_AT_decl_file   : 6
    <1059>   DW_AT_decl_line   : 586
    <105b>   DW_AT_decl_column : 9
    <105b>   DW_AT_sibling     : <0x107b>
 <2><105f>: Abbrev Number: 6 (DW_TAG_member)
    <1060>   DW_AT_name        : CR
    <1063>   DW_AT_decl_file   : 6
    <1064>   DW_AT_decl_line   : 588
    <1066>   DW_AT_decl_column : 17
    <1067>   DW_AT_type        : <0xc41>
    <106b>   DW_AT_data_member_location: 0
 <2><106c>: Abbrev Number: 6 (DW_TAG_member)
    <106d>   DW_AT_name        : CSR
    <1071>   DW_AT_decl_file   : 6
    <1072>   DW_AT_decl_line   : 589
    <1074>   DW_AT_decl_column : 17
    <1075>   DW_AT_type        : <0xc41>
    <1079>   DW_AT_data_member_location: 4
 <2><107a>: Abbrev Number: 0
 <1><107b>: Abbrev Number: 18 (DW_TAG_typedef)
    <107c>   DW_AT_name        : (indirect string, offset: 0xd7742): PWR_TypeDef
    <1080>   DW_AT_decl_file   : 6
    <1081>   DW_AT_decl_line   : 590
    <1083>   DW_AT_decl_column : 3
    <1084>   DW_AT_type        : <0x1056>
 <1><1088>: Abbrev Number: 24 (DW_TAG_structure_type)
    <1089>   DW_AT_byte_size   : 136
    <108a>   DW_AT_decl_file   : 6
    <108b>   DW_AT_decl_line   : 596
    <108d>   DW_AT_decl_column : 9
    <108d>   DW_AT_sibling     : <0x1235>
 <2><1091>: Abbrev Number: 6 (DW_TAG_member)
    <1092>   DW_AT_name        : CR
    <1095>   DW_AT_decl_file   : 6
    <1096>   DW_AT_decl_line   : 598
    <1098>   DW_AT_decl_column : 17
    <1099>   DW_AT_type        : <0xc41>
    <109d>   DW_AT_data_member_location: 0
 <2><109e>: Abbrev Number: 3 (DW_TAG_member)
    <109f>   DW_AT_name        : (indirect string, offset: 0xd76d9): PLLCFGR
